zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @defgroup RCC_HSI_Clock_Prescaler RCC_HSI_Clock_Prescaler
  * @{
  */
#define RCC_HSI_DIV1                  0U                    /* Division by 1, ck_hsi(_ker) = 64 MHz (default */
/* after reset)*/
#define RCC_HSI_DIV2                  RCC_HSICFGR_HSIDIV_0  /* Division by 2, ck_hsi(_ker) = 32 MHz*/
#define RCC_HSI_DIV4                  RCC_HSICFGR_HSIDIV_1  /* Division by 4, ck_hsi(_ker) = 16 MHz*/
#define RCC_HSI_DIV8                  (RCC_HSICFGR_HSIDIV_0 | RCC_HSICFGR_HSIDIV_1)  /* Division by 8, */
/* ck_hsi(_ker) =  8 MHz*/

#define IS_RCC_HSIDIV(DIV)    (((DIV) == RCC_HSI_DIV1)  || ((DIV) == RCC_HSI_DIV2) || \
                               ((DIV) == RCC_HSI_DIV4) || ((DIV) == RCC_HSI_DIV8)    )
/**
  * @}
  */


/** @defgroup RCC_LSI_Config RCC_LSI_Config
  * @{
  */
#define RCC_LSI_OFF                    ((uint32_t)0x00000000U)
#define RCC_LSI_ON                     RCC_RDLSICR_LSION

#define IS_RCC_LSI(LSI) (((LSI) == RCC_LSI_OFF) || ((LSI) == RCC_LSI_ON))
/**
  * @}
  */

/** @defgroup RCC_CSI_Config RCC_CSI_Config
  * @{
  */
#define RCC_CSI_OFF                    ((uint32_t)0x00000000U)
#define RCC_CSI_ON                     RCC_OCENSETR_CSION

#define IS_RCC_CSI(CSI) (((CSI) == RCC_CSI_OFF) || ((CSI) == RCC_CSI_ON))
/**
  * @}
  */


/** @defgroup RCC_MCO_Index RCC_MCO_Index
  * @{
  */
#define RCC_MCO1                       ((uint32_t)0x00000000U)
#define RCC_MCO2                       ((uint32_t)0x00000001U)

#define IS_RCC_MCO(MCOx) (((MCOx) == RCC_MCO1) || ((MCOx) == RCC_MCO2))
/**
  * @}
  */

/** @defgroup RCC_MCO1_Clock_Source RCC_MCO1_Clock_Source
  * @{
  */
#define RCC_MCO1SOURCE_HSI             0U
#define RCC_MCO1SOURCE_HSE             RCC_MCO1CFGR_MCO1SEL_0
#define RCC_MCO1SOURCE_CSI             RCC_MCO1CFGR_MCO1SEL_1
#define RCC_MCO1SOURCE_LSI             (RCC_MCO1CFGR_MCO1SEL_0 | RCC_MCO1CFGR_MCO1SEL_1)
#define RCC_MCO1SOURCE_LSE             RCC_MCO1CFGR_MCO1SEL_2


#define IS_RCC_MCO1SOURCE(SOURCE) (((SOURCE) == RCC_MCO1SOURCE_HSI) || ((SOURCE) == RCC_MCO1SOURCE_HSE)     || \
                                   ((SOURCE) == RCC_MCO1SOURCE_CSI) || ((SOURCE) == RCC_MCO1SOURCE_LSI)  || \
                                   ((SOURCE) == RCC_MCO1SOURCE_LSE) )
/**
  * @}
  */

/** @defgroup RCC_MCO2_Clock_Source RCC_MCO2_Clock_Source
  * @{
  */
#define RCC_MCO2SOURCE_MPU             0U
#define RCC_MCO2SOURCE_AXI             RCC_MCO2CFGR_MCO2SEL_0
#define RCC_MCO2SOURCE_MLAHB            RCC_MCO2CFGR_MCO2SEL_1
#define RCC_MCO2SOURCE_PLL4            (RCC_MCO2CFGR_MCO2SEL_1 | RCC_MCO2CFGR_MCO2SEL_0)
#define RCC_MCO2SOURCE_HSE             RCC_MCO2CFGR_MCO2SEL_2
#define RCC_MCO2SOURCE_HSI             (RCC_MCO2CFGR_MCO2SEL_2 | RCC_MCO2CFGR_MCO2SEL_0)

#define IS_RCC_MCO2SOURCE(SOURCE) (((SOURCE) == RCC_MCO2SOURCE_MPU) || ((SOURCE) == RCC_MCO2SOURCE_AXI)   || \
                                   ((SOURCE) == RCC_MCO2SOURCE_MLAHB)    || ((SOURCE) == RCC_MCO2SOURCE_PLL4)   || \
                                   ((SOURCE) == RCC_MCO2SOURCE_HSE)    || ((SOURCE) == RCC_MCO2SOURCE_HSI))
/**
  * @}
  */

/** @defgroup RCC_MCOx_Clock_Prescaler RCC_MCOx_Clock_Prescaler
  * @{
  * @note: MCO1 division factors are used for MCODIV values as they are the same for MCO2
  */
#define RCC_MCODIV_1                   0U
#define RCC_MCODIV_2                   RCC_MCO1CFGR_MCO1DIV_0
#define RCC_MCODIV_3                   RCC_MCO1CFGR_MCO1DIV_1
#define RCC_MCODIV_4                   (RCC_MCO1CFGR_MCO1DIV_1 | RCC_MCO1CFGR_MCO1DIV_0)
#define RCC_MCODIV_5                   RCC_MCO1CFGR_MCO1DIV_2
#define RCC_MCODIV_6                   (RCC_MCO1CFGR_MCO1DIV_2 | RCC_MCO1CFGR_MCO1DIV_0)
#define RCC_MCODIV_7                   (RCC_MCO1CFGR_MCO1DIV_2 | RCC_MCO1CFGR_MCO1DIV_1)
#define RCC_MCODIV_8                   (RCC_MCO1CFGR_MCO1DIV_2 | RCC_MCO1CFGR_MCO1DIV_1 | RCC_MCO1CFGR_MCO1DIV_0)
#define RCC_MCODIV_9                   RCC_MCO1CFGR_MCO1DIV_3
#define RCC_MCODIV_10                  (RCC_MCO1CFGR_MCO1DIV_3 | RCC_MCO1CFGR_MCO1DIV_0)
#define RCC_MCODIV_11                  (RCC_MCO1CFGR_MCO1DIV_3 | RCC_MCO1CFGR_MCO1DIV_1)
#define RCC_MCODIV_12                  (RCC_MCO1CFGR_MCO1DIV_3 | RCC_MCO1CFGR_MCO1DIV_1 | RCC_MCO1CFGR_MCO1DIV_0)
#define RCC_MCODIV_13                  (RCC_MCO1CFGR_MCO1DIV_3 | RCC_MCO1CFGR_MCO1DIV_2)
#define RCC_MCODIV_14                  (RCC_MCO1CFGR_MCO1DIV_3 | RCC_MCO1CFGR_MCO1DIV_2 | RCC_MCO1CFGR_MCO1DIV_0)
#define RCC_MCODIV_15                  (RCC_MCO1CFGR_MCO1DIV_3 | RCC_MCO1CFGR_MCO1DIV_2 | RCC_MCO1CFGR_MCO1DIV_1)
#define RCC_MCODIV_16                  (RCC_MCO1CFGR_MCO1DIV_3 |\
                                        RCC_MCO1CFGR_MCO1DIV_2 | RCC_MCO1CFGR_MCO1DIV_1 | RCC_MCO1CFGR_MCO1DIV_0)


#define IS_RCC_MCODIV(DIV)  (((DIV) == RCC_MCODIV_1)  || ((DIV) == RCC_MCODIV_2) || \
                             ((DIV) == RCC_MCODIV_3) || ((DIV) == RCC_MCODIV_4)   || \
                             ((DIV) == RCC_MCODIV_5) || ((DIV) == RCC_MCODIV_6)   || \
                             ((DIV) == RCC_MCODIV_7) || ((DIV) == RCC_MCODIV_8)   || \
                             ((DIV) == RCC_MCODIV_9) || ((DIV) == RCC_MCODIV_10)  || \
                             ((DIV) == RCC_MCODIV_11) || ((DIV) == RCC_MCODIV_12) || \
                             ((DIV) == RCC_MCODIV_13) || ((DIV) == RCC_MCODIV_14) || \
                             ((DIV) == RCC_MCODIV_15)  || ((DIV) == RCC_MCODIV_16)    )
/**
  * @}
  */


/** @defgroup RCC_MPU_Clock_Source RCC_MPU_Clock_Source
  * @{
  */
#define RCC_MPUSOURCE_HSI              0U
#define RCC_MPUSOURCE_HSE              RCC_MPCKSELR_MPUSRC_0
#define RCC_MPUSOURCE_PLL1             RCC_MPCKSELR_MPUSRC_1
#define RCC_MPUSOURCE_MPUDIV           (RCC_MPCKSELR_MPUSRC_0 | RCC_MPCKSELR_MPUSRC_1)

#define IS_RCC_MPUSOURCE(SOURCE) (((SOURCE) == RCC_MPUSOURCE_HSI)    || \
                                  ((SOURCE) == RCC_MPUSOURCE_HSE)     || \
                                  ((SOURCE) == RCC_MPUSOURCE_PLL1)    || \
                                  ((SOURCE) == RCC_MPUSOURCE_MPUDIV))
/**
  * @}
  */

/** @defgroup RCC_AXISS_Clock_Source RCC_AXISS_Clock_Source
  * @{
  */
#define RCC_AXISSOURCE_HSI            0U
#define RCC_AXISSOURCE_HSE            RCC_ASSCKSELR_AXISSRC_0
#define RCC_AXISSOURCE_PLL2           RCC_ASSCKSELR_AXISSRC_1
#define RCC_AXISSOURCE_OFF            (RCC_ASSCKSELR_AXISSRC_1 | RCC_ASSCKSELR_AXISSRC_0)

#define IS_RCC_AXISSOURCE(SOURCE) (((SOURCE) == RCC_AXISSOURCE_HSI)  || \
                                   ((SOURCE) == RCC_AXISSOURCE_HSE)  || \
                                   ((SOURCE) == RCC_AXISSOURCE_PLL2) || \
                                   ((SOURCE) == RCC_AXISSOURCE_OFF))
/**
  * @}
  */

#if defined(RCC_MSSCKSELR_MLAHBSSRC)
/** @defgroup RCC_MLAHB_Clock_Source RCC_MLAHB_Clock_Source
  * @{
  */
#define RCC_MLAHBSSOURCE_HSI              0U
#define RCC_MLAHBSSOURCE_HSE              RCC_MSSCKSELR_MLAHBSSRC_0
#define RCC_MLAHBSSOURCE_CSI              RCC_MSSCKSELR_MLAHBSSRC_1
#define RCC_MLAHBSSOURCE_PLL3             (RCC_MSSCKSELR_MLAHBSSRC_1 | RCC_MSSCKSELR_MLAHBSSRC_0)

#define IS_RCC_MLAHBSSOURCE(SOURCE) (((SOURCE) == RCC_MLAHBSSOURCE_HSI)   || \
                                     ((SOURCE) == RCC_MLAHBSSOURCE_HSE)    || \
                                     ((SOURCE) == RCC_MLAHBSSOURCE_CSI)    || \
                                     ((SOURCE) == RCC_MLAHBSSOURCE_PLL3))
/**
  * @}
  */
#endif /* RCC_MSSCKSELR_MLAHBSSRC */

