zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @defgroup RCC_RTC_Division_Factor RCC_RTC_Division_Factor
  * @{
  */
#define RCC_RTCDIV(x)                  (uint32_t)(x - 1U)

#define IS_RCC_RTC_HSEDIV(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 64U))
/**
  * @}
  */

/** @defgroup RCC_MPU_Clock_Divider RCC_MPU_Clock_Divider
  * @{
  */
#define RCC_MPU_DIV_OFF                0U
#define RCC_MPU_DIV2                   RCC_MPCKDIVR_MPUDIV_0
#define RCC_MPU_DIV4                   RCC_MPCKDIVR_MPUDIV_1
#define RCC_MPU_DIV8                   (RCC_MPCKDIVR_MPUDIV_1 | RCC_MPCKDIVR_MPUDIV_0)
#define RCC_MPU_DIV16                  RCC_MPCKDIVR_MPUDIV_2

#define IS_RCC_MPUDIV(DIVIDER) (  ((DIVIDER) == RCC_MPU_DIV2)  || \
                                  ((DIVIDER) == RCC_MPU_DIV4)  || \
                                  ((DIVIDER) == RCC_MPU_DIV8)  || \
                                  ((DIVIDER) == RCC_MPU_DIV16))
/**
  * @}
  */

/** @defgroup RCC_AXI_Clock_Divider RCC_AXI_Clock_Divider
  * @{
  */
#define RCC_AXI_DIV1                   0U
#define RCC_AXI_DIV2                   RCC_AXIDIVR_AXIDIV_0
#define RCC_AXI_DIV3                   RCC_AXIDIVR_AXIDIV_1
#define RCC_AXI_DIV4                   (RCC_AXIDIVR_AXIDIV_0 | RCC_AXIDIVR_AXIDIV_1)

#define IS_RCC_AXIDIV(DIVIDER) (((DIVIDER) == RCC_AXI_DIV1)   || \
                                ((DIVIDER) == RCC_AXI_DIV2)  || \
                                ((DIVIDER) == RCC_AXI_DIV3)  || \
                                ((DIVIDER) == RCC_AXI_DIV4))
/**
  * @}
  */

/** @defgroup RCC_APB4_Clock_Divider RCC_APB4_Clock_Divider
  * @{
  */
#define RCC_APB4_DIV1                   0U
#define RCC_APB4_DIV2                   RCC_APB4DIVR_APB4DIV_0
#define RCC_APB4_DIV4                   RCC_APB4DIVR_APB4DIV_1
#define RCC_APB4_DIV8                   (RCC_APB4DIVR_APB4DIV_1 | RCC_APB4DIVR_APB4DIV_0)
#define RCC_APB4_DIV16                  RCC_APB4DIVR_APB4DIV_2

#define IS_RCC_APB4DIV(DIVIDER) (((DIVIDER) == RCC_APB4_DIV1)   || \
                                 ((DIVIDER) == RCC_APB4_DIV2)   || \
                                 ((DIVIDER) == RCC_APB4_DIV4)   || \
                                 ((DIVIDER) == RCC_APB4_DIV8)   || \
                                 ((DIVIDER) == RCC_APB4_DIV16))
/**
  * @}
  */

/** @defgroup RCC_APB5_Clock_Divider RCC_APB5_Clock_Divider
  * @{
  */
#define RCC_APB5_DIV1                   0U
#define RCC_APB5_DIV2                   RCC_APB5DIVR_APB5DIV_0
#define RCC_APB5_DIV4                   RCC_APB5DIVR_APB5DIV_1
#define RCC_APB5_DIV8                   (RCC_APB5DIVR_APB5DIV_1 | RCC_APB5DIVR_APB5DIV_0)
#define RCC_APB5_DIV16                  RCC_APB5DIVR_APB5DIV_2

#define IS_RCC_APB5DIV(DIVIDER) (((DIVIDER) == RCC_APB5_DIV1)   || \
                                 ((DIVIDER) == RCC_APB5_DIV2)   || \
                                 ((DIVIDER) == RCC_APB5_DIV4)   || \
                                 ((DIVIDER) == RCC_APB5_DIV8)   || \
                                 ((DIVIDER) == RCC_APB5_DIV16))
/**
  * @}
  */

#if defined(RCC_MLAHBDIVR_MLAHBDIV)
/** @defgroup RCC_MLAHB_Clock_Divider RCC_MLAHB_Clock_Divider
  * @{
  */
#define RCC_MLAHB_DIV1                   0U
#define RCC_MLAHB_DIV2                   RCC_MLAHBDIVR_MLAHBDIV_0
#define RCC_MLAHB_DIV4                   RCC_MLAHBDIVR_MLAHBDIV_1
#define RCC_MLAHB_DIV8                   (RCC_MLAHBDIVR_MLAHBDIV_1 | RCC_MLAHBDIVR_MLAHBDIV_0)
#define RCC_MLAHB_DIV16                  RCC_MLAHBDIVR_MLAHBDIV_2
#define RCC_MLAHB_DIV32                  (RCC_MLAHBDIVR_MLAHBDIV_2 | RCC_MLAHBDIVR_MLAHBDIV_0)
#define RCC_MLAHB_DIV64                  (RCC_MLAHBDIVR_MLAHBDIV_2 | RCC_MLAHBDIVR_MLAHBDIV_1)
#define RCC_MLAHB_DIV128                 (RCC_MLAHBDIVR_MLAHBDIV_2 |\
                                          RCC_MLAHBDIVR_MLAHBDIV_1 | RCC_MLAHBDIVR_MLAHBDIV_0)
#define RCC_MLAHB_DIV256                 RCC_MLAHBDIVR_MLAHBDIV_3
#define RCC_MLAHB_DIV512                 (RCC_MLAHBDIVR_MLAHBDIV_3 | RCC_MLAHBDIVR_MLAHBDIV_0)

#define IS_RCC_MLAHBDIV(DIVIDER) (((DIVIDER) == RCC_MLAHB_DIV1)  || \
                                  ((DIVIDER) == RCC_MLAHB_DIV2)   || \
                                  ((DIVIDER) == RCC_MLAHB_DIV4)   || \
                                  ((DIVIDER) == RCC_MLAHB_DIV8)   || \
                                  ((DIVIDER) == RCC_MLAHB_DIV16)  || \
                                  ((DIVIDER) == RCC_MLAHB_DIV32)  || \
                                  ((DIVIDER) == RCC_MLAHB_DIV64)  || \
                                  ((DIVIDER) == RCC_MLAHB_DIV128) || \
                                  ((DIVIDER) == RCC_MLAHB_DIV256) || \
                                  ((DIVIDER) == RCC_MLAHB_DIV512))
/**
  * @}
  */
#endif /* RCC_MLAHBDIVR_MLAHBDIV */

/** @defgroup RCC_APB1_Clock_Divider RCC_APB1_Clock_Divider
  * @{
  */
#define RCC_APB1_DIV1                   0U
#define RCC_APB1_DIV2                   RCC_APB1DIVR_APB1DIV_0
#define RCC_APB1_DIV4                   RCC_APB1DIVR_APB1DIV_1
#define RCC_APB1_DIV8                   (RCC_APB1DIVR_APB1DIV_1 | RCC_APB1DIVR_APB1DIV_0)
#define RCC_APB1_DIV16                  RCC_APB1DIVR_APB1DIV_2

#define IS_RCC_APB1DIV(DIVIDER) (((DIVIDER) == RCC_APB1_DIV1)   || \
                                 ((DIVIDER) == RCC_APB1_DIV2)   || \
                                 ((DIVIDER) == RCC_APB1_DIV4)   || \
                                 ((DIVIDER) == RCC_APB1_DIV8)   || \
                                 ((DIVIDER) == RCC_APB1_DIV16))
/**
  * @}
  */

/** @defgroup RCC_APB2_Clock_Divider RCC_APB2_Clock_Divider
  * @{
  */
#define RCC_APB2_DIV1                   0U
#define RCC_APB2_DIV2                   RCC_APB2DIVR_APB2DIV_0
#define RCC_APB2_DIV4                   RCC_APB2DIVR_APB2DIV_1
#define RCC_APB2_DIV8                   (RCC_APB2DIVR_APB2DIV_1 | RCC_APB2DIVR_APB2DIV_0)
#define RCC_APB2_DIV16                  RCC_APB2DIVR_APB2DIV_2

#define IS_RCC_APB2DIV(DIVIDER) (((DIVIDER) == RCC_APB2_DIV1)   || \
                                 ((DIVIDER) == RCC_APB2_DIV2)   || \
                                 ((DIVIDER) == RCC_APB2_DIV4)   || \
                                 ((DIVIDER) == RCC_APB2_DIV8)   || \
                                 ((DIVIDER) == RCC_APB2_DIV16))
/**
  * @}
  */

