zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @defgroup RCC_APB3_Clock_Divider RCC_APB3_Clock_Divider
  * @{
  */
#define RCC_APB3_DIV1                   0U
#define RCC_APB3_DIV2                   RCC_APB3DIVR_APB3DIV_0
#define RCC_APB3_DIV4                   RCC_APB3DIVR_APB3DIV_1
#define RCC_APB3_DIV8                   (RCC_APB3DIVR_APB3DIV_1| RCC_APB3DIVR_APB3DIV_0)
#define RCC_APB3_DIV16                  RCC_APB3DIVR_APB3DIV_2

#define IS_RCC_APB3DIV(DIVIDER) (((DIVIDER) == RCC_APB3_DIV1)   || \
                                 ((DIVIDER) == RCC_APB3_DIV2)   || \
                                 ((DIVIDER) == RCC_APB3_DIV4)   || \
                                 ((DIVIDER) == RCC_APB3_DIV8)   || \
                                 ((DIVIDER) == RCC_APB3_DIV16))
/**
  * @}
  */
#if defined(RCC_APB6DIVR_APB6DIV)
/** @defgroup RCC_APB6_Clock_Divider RCC_APB6_Clock_Divider
  * @{
  */
#define RCC_APB6_DIV1                   0U
#define RCC_APB6_DIV2                   RCC_APB6DIVR_APB6DIV_0
#define RCC_APB6_DIV4                   RCC_APB6DIVR_APB6DIV_1
#define RCC_APB6_DIV8                   (RCC_APB6DIVR_APB6DIV_1 | RCC_APB6DIVR_APB6DIV_0)
#define RCC_APB6_DIV16                  RCC_APB6DIVR_APB6DIV_2

#define IS_RCC_APB6DIV(DIVIDER) (((DIVIDER) == RCC_APB6_DIV1)   || \
                                 ((DIVIDER) == RCC_APB6_DIV2)   || \
                                 ((DIVIDER) == RCC_APB6_DIV4)   || \
                                 ((DIVIDER) == RCC_APB6_DIV8)   || \
                                 ((DIVIDER) == RCC_APB6_DIV16))
/**
  * @}
  */
#endif /* RCC_APB6DIVR_APB6DIV */

/** @defgroup RCC_PLL_Config RCC_PLL_Config
  * @{
  */
#define RCC_PLL_NONE                   ((uint32_t)0x00000000U)
#define RCC_PLL_OFF                    ((uint32_t)0x00000001U)
#define RCC_PLL_ON                     ((uint32_t)0x00000002U)

#define IS_RCC_PLL(PLL) (((PLL) == RCC_PLL_NONE) ||((PLL) == RCC_PLL_OFF) || \
                         ((PLL) == RCC_PLL_ON))
/**
  * @}
  */

/** @defgroup RCC_PLL_Mode RCC_PLL_Mode
  * @{
  */
#define RCC_PLL_INTEGER                 ((uint32_t)0x00000000U)
#define RCC_PLL_FRACTIONAL              ((uint32_t)0x00000001U)
#define RCC_PLL_SPREAD_SPECTRUM         ((uint32_t)0x00000002U)

#define IS_RCC_PLLMODE(MODE) (((MODE) == RCC_PLL_FRACTIONAL) || \
                              ((MODE) == RCC_PLL_INTEGER) || \
                              ((MODE) == RCC_PLL_SPREAD_SPECTRUM))
/**
  * @}
  */


/** @defgroup RCC_SSCG_MODE RCC_SSCG_MODE
  * @{
  */
#define RCC_SSCG_CENTER_SPREAD          ((uint32_t)0x00000000U)
#define RCC_SSCG_DOWN_SPREAD            ((uint32_t)RCC_PLL1CSGR_SSCG_MODE)

#define IS_RCC_SSCG_MODE(MODE) (((MODE) == RCC_SSCG_CENTER_SPREAD) || \
                                ((MODE) == RCC_SSCG_DOWN_SPREAD))
/**
  * @}
  */

/** @defgroup RCC_MOD_PER RCC_MOD_PER
  * @{
  */
#define RCC_MOD_PER_MIN          ((uint32_t)0x00000001U)
#define RCC_MOD_PER_MAX           ((uint32_t)RCC_PLL1CSGR_MOD_PER) /* 8191 */

#define IS_RCC_MOD_PER(ADJ) ((RCC_MOD_PER_MIN <= (ADJ)) && \
                             ((ADJ) <= RCC_MOD_PER_MAX))
/**
  * @}
  */

/** @defgroup RCC_INC_STEP RCC_INC_STEP
  * @{
  */
#define RCC_INC_STEP_MIN          ((uint32_t)0x00000001U)
#define RCC_INC_STEP_MAX           ((uint32_t)0x7FFFU) /* 32767 */

#define IS_RCC_INC_STEP(ADJ) ((RCC_INC_STEP_MIN <= (ADJ)) && \
                              ((ADJ) <= RCC_INC_STEP_MAX))
/**
  * @}
  */

/** @defgroup RCC_RPDFN_DIS RCC_RPDFN_DIS
  * @{
  */
#define RCC_RPDFN_DIS_ENABLED          ((uint32_t)0x00000000U)
#define RCC_RPDFN_DIS_DISABLED         ((uint32_t)RCC_PLL1CSGR_RPDFN_DIS)

#define IS_RCC_RPDFN_DIS(STATE) (((STATE) == RCC_RPDFN_DIS_DISABLED) || \
                                 ((STATE) == RCC_RPDFN_DIS_ENABLED))
/**
  * @}
  */


/** @defgroup RCC_TPDFN_DIS RCC_TPDFN_DIS
  * @{
  */
#define RCC_TPDFN_DIS_ENABLED            ((uint32_t)0x00000000U)
#define RCC_TPDFN_DIS_DISABLED           ((uint32_t)RCC_PLL1CSGR_TPDFN_DIS)

#define IS_RCC_TPDFN_DIS(STATE) (((STATE) == RCC_TPDFN_DIS_DISABLED) || \
                                 ((STATE) == RCC_TPDFN_DIS_ENABLED))
/**
  * @}
  */


/** @defgroup RCC_PLL12_Clock_Source RCC_PLL12_Clock_Source
  * @{
  */
#define RCC_PLL12SOURCE_HSI              0U
#define RCC_PLL12SOURCE_HSE              RCC_RCK12SELR_PLL12SRC_0
#define RCC_PLL12SOURCE_OFF              RCC_RCK12SELR_PLL12SRC_1

#define IS_RCC_PLL12SOURCE(SOURCE) (((SOURCE) == RCC_PLL12SOURCE_HSI) || \
                                    ((SOURCE) == RCC_PLL12SOURCE_HSE) || \
                                    ((SOURCE) == RCC_PLL12SOURCE_OFF))
/**
  * @}
  */


/** @defgroup RCC_PLL3_Clock_Source RCC_PLL3_Clock_Source
  * @{
  */
#define RCC_PLL3SOURCE_HSI              0U
#define RCC_PLL3SOURCE_HSE              RCC_RCK3SELR_PLL3SRC_0
#define RCC_PLL3SOURCE_CSI              RCC_RCK3SELR_PLL3SRC_1
#define RCC_PLL3SOURCE_OFF              (RCC_RCK3SELR_PLL3SRC_1 | RCC_RCK3SELR_PLL3SRC_0)


#define IS_RCC_PLL3SOURCE(SOURCE) (((SOURCE) == RCC_PLL3SOURCE_HSI)  || \
                                   ((SOURCE) == RCC_PLL3SOURCE_HSE)  || \
                                   ((SOURCE) == RCC_PLL3SOURCE_CSI)  || \
                                   ((SOURCE) == RCC_PLL3SOURCE_OFF))

/**
  * @}
  */


/** @defgroup RCC_PLL4_Clock_Source RCC_PLL4_Clock_Source
  * @{
  */
#define RCC_PLL4SOURCE_HSI              0U
#define RCC_PLL4SOURCE_HSE              RCC_RCK4SELR_PLL4SRC_0
#define RCC_PLL4SOURCE_CSI              RCC_RCK4SELR_PLL4SRC_1
#define RCC_PLL4SOURCE_I2S_CKIN         (RCC_RCK4SELR_PLL4SRC_1 | RCC_RCK4SELR_PLL4SRC_0)


#define IS_RCC_PLL4SOURCE(SOURCE) (((SOURCE) == RCC_PLL4SOURCE_HSI)  || \
                                   ((SOURCE) == RCC_PLL4SOURCE_HSE)  || \
                                   ((SOURCE) == RCC_PLL4SOURCE_CSI)  || \
                                   ((SOURCE) == RCC_PLL4SOURCE_I2S_CKIN))
/**
  * @}
  */

/** @defgroup RCC_PLL1_MUL_DIV_Factors RCC_PLL1_MUL_DIV_Factors
  * @{
  */
#define IS_RCC_PLLM1_VALUE(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 64U))
/* @note DIVN limits are different depending if using integer or fractional mode */
#define IS_RCC_PLLN1_INT_VALUE(VALUE)  ((25U <= (VALUE)) && ((VALUE) <= 100U))
#define IS_RCC_PLLN1_FRAC_VALUE(VALUE) ((4U <= (VALUE)) && ((VALUE) <= 512U))
#define IS_RCC_PLLP1_VALUE(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 128U))
#define IS_RCC_PLLQ1_VALUE(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 128U))
#define IS_RCC_PLLR1_VALUE(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 128U))
/**
  * @}
  */

/** @defgroup RCC_PLL2_MUL_DIV_Factors RCC_PLL2_MUL_DIV_Factors
  * @{
  */
#define IS_RCC_PLLM2_VALUE(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 64U))
/* @note DIVN limits are different depending if using integer or fractional mode */
#define IS_RCC_PLLN2_INT_VALUE(VALUE)  ((25U <= (VALUE)) && ((VALUE) <= 100U))
#define IS_RCC_PLLN2_FRAC_VALUE(VALUE) ((4U <= (VALUE)) && ((VALUE) <= 512U))
#define IS_RCC_PLLP2_VALUE(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 128U))
#define IS_RCC_PLLQ2_VALUE(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 128U))
#define IS_RCC_PLLR2_VALUE(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 128U))
/**
  * @}
  */

