zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/* Flags in the TIMG3PRER register */
#define RCC_FLAG_TIMG3PRERDY      ( (RCC->TIMG3PRER & RCC_TIMG3PRER_TIMG3PRERDY) == RCC_TIMG3PRER_TIMG3PRERDY )

/* Flags in the MPCKDIVR register */
#define RCC_FLAG_MPUDIVRDY        ( (RCC->MPCKDIVR & RCC_MPCKDIVR_MPUDIVRDY)     == RCC_MPCKDIVR_MPUDIVRDY )

/* Flags in the AXIDIVR register */
#define RCC_FLAG_AXIDIVRDY        ( (RCC->AXIDIVR & RCC_AXIDIVR_AXIDIVRDY)       == RCC_AXIDIVR_AXIDIVRDY )

/* Flags in the APB4DIVR register */
#define RCC_FLAG_APB4DIVRDY       ( (RCC->APB4DIVR & RCC_APB4DIVR_APB4DIVRDY)    == RCC_APB4DIVR_APB4DIVRDY )

/* Flags in the APB5DIVR register */
#define RCC_FLAG_APB5DIVRDY       ( (RCC->APB5DIVR & RCC_APB5DIVR_APB5DIVRDY)    == RCC_APB5DIVR_APB5DIVRDY )

/* Flags in the MLAHBDIVR register */
#define RCC_FLAG_MLAHBDIVRDY        ( (RCC->MLAHBDIVR & RCC_MLAHBDIVR_MLAHBDIVRDY) ==  RCC_MLAHBDIVR_MLAHBDIVRDY )

/* Flags in the APB1DIVR register */
#define RCC_FLAG_APB1DIVRDY       ((RCC->APB1DIVR & RCC_APB1DIVR_APB1DIVRDY)     ==  RCC_APB1DIVR_APB1DIVRDY )

/* Flags in the APB2DIVR register */
#define RCC_FLAG_APB2DIVRDY       ((RCC->APB2DIVR & RCC_APB2DIVR_APB2DIVRDY)     ==  RCC_APB2DIVR_APB2DIVRDY )

/* Flags in the APB3DIVR register */
#define RCC_FLAG_APB3DIVRDY       ((RCC->APB3DIVR & RCC_APB3DIVR_APB3DIVRDY)     ==  RCC_APB3DIVR_APB3DIVRDY )

#if defined(RCC_APB6DIVR_APB6DIV)
/* Flags in the APB6DIVR register */
#define RCC_FLAG_APB6DIVRDY       ((RCC->APB6DIVR & RCC_APB6DIVR_APB6DIVRDY)     ==  RCC_APB6DIVR_APB6DIVRDY )
#endif /* RCC_APB6DIVR_APB6DIV */

/* Flags in the PLL1CR register */
#define RCC_FLAG_PLL1RDY          ((RCC->PLL1CR & RCC_PLL1CR_PLL1RDY)            ==  RCC_PLL1CR_PLL1RDY )

/* Flags in the PLL2CR register */
#define RCC_FLAG_PLL2RDY          ((RCC->PLL2CR & RCC_PLL2CR_PLL2RDY)            ==  RCC_PLL2CR_PLL2RDY )

/* Flags in the PLL3CR register */
#define RCC_FLAG_PLL3RDY          ((RCC->PLL3CR & RCC_PLL3CR_PLL3RDY)            ==  RCC_PLL3CR_PLL3RDY )

/* Flags in the PLL4CR register */
#define RCC_FLAG_PLL4RDY          ((RCC->PLL4CR & RCC_PLL4CR_PLL4RDY)            ==  RCC_PLL4CR_PLL4RDY )

/* Flags in the DDRCKSELR register */
#define RCC_FLAG_DDRPHYCSRCRDY    ((RCC->DDRCKSELR & RCC_DDRCKSELR_DDRPHYCSRCRDY) == RCC_DDRCKSELR_DDRPHYCSRCRDY )

/* Flags in the BDCR register */
#define RCC_FLAG_LSERDY          ((RCC->BDCR & RCC_BDCR_LSERDY)                 ==  RCC_BDCR_LSERDY )

/* Flags in the RDLSICR register */
#define RCC_FLAG_LSIRDY           ((RCC->RDLSICR & RCC_RDLSICR_LSIRDY)           ==  RCC_RDLSICR_LSIRDY )

#if defined(CORE_CA7)
/* Flags in the RCC_MP_RSTSSETR */
#define RCC_MASK_ALL_RESET_FLAGS  (0x00001F7FU)
#define RCC_FLAG_PORRST           ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_PORRSTF)  == RCC_MP_RSTSSETR_PORRSTF)
#define RCC_FLAG_BORRST           ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_BORRSTF)  == RCC_MP_RSTSSETR_BORRSTF)
#define RCC_FLAG_PADRST           ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_PADRSTF)  == RCC_MP_RSTSSETR_PADRSTF)
#define RCC_FLAG_HCSSRST          ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_HCSSRSTF) == RCC_MP_RSTSSETR_HCSSRSTF)
#define RCC_FLAG_VCORERST         ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_VCORERSTF)  == RCC_MP_RSTSSETR_VCORERSTF)
#define RCC_FLAG_VCPURST          ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_VCPURSTF)  == RCC_MP_RSTSSETR_VCPURSTF)
#define RCC_FLAG_MPSYSRSTF        ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_MPSYSRSTF)  == RCC_MP_RSTSSETR_MPSYSRSTF)
#define RCC_FLAG_IWDG1RST         ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_IWDG1RSTF)  == RCC_MP_RSTSSETR_IWDG1RSTF)
#define RCC_FLAG_IWDG2RST         ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_IWDG2RSTF)  == RCC_MP_RSTSSETR_IWDG2RSTF)
#define RCC_FLAG_STP2RST          ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_STP2RSTF)  == RCC_MP_RSTSSETR_STP2RSTF)
#define RCC_FLAG_STDBYRSTF        ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_STDBYRSTF)  == RCC_MP_RSTSSETR_STDBYRSTF)
#define RCC_FLAG_CSTDBYRSTF       ((RCC->MP_RSTSSETR & RCC_MP_RSTSSETR_CSTDBYRSTF) == RCC_MP_RSTSSETR_CSTDBYRSTF)
#endif /* CORE_CA7 */

/** @brief  Clear all the reset flags
  * @note   Writing a '1' clears the corresponding bit to '0'
  */
#if defined(CORE_CA7)
#define __HAL_RCC_CLEAR_RESET_FLAGS() WRITE_REG(RCC->MP_RSTSCLRR, RCC_MASK_ALL_RESET_FLAGS)
#endif /* CORE_CA7 */

#if defined(CORE_CA7)
/** @brief  Check RCC flag is set or not.
  * @param  __FLAG__: specifies the flag to check.
  *         This parameter can be one of the following values:
  *         @arg RCC_FLAG_PORRST
  *         @arg RCC_FLAG_BORRST
  *         @arg RCC_FLAG_PADRST
  *         @arg RCC_FLAG_HCSSRST
  *         @arg RCC_FLAG_VCORERST
  *         @arg RCC_FLAG_VCPURST
  *         @arg RCC_FLAG_MPSYSRSTF
  *         @arg RCC_FLAG_IWDG1RST
  *         @arg RCC_FLAG_IWDG2RST
  *         @arg RCC_FLAG_STP2RST
  *         @arg RCC_FLAG_STDBYRSTF
  *         @arg RCC_FLAG_CSTDBYRSTF
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#endif /* CORE_CA7 */

#define __HAL_RCC_GET_FLAG(__FLAG__) ( __FLAG__ ? 1U : 0U)
/**
  * @}
  */

/** @defgroup RCC_Calibration RCC_Calibration limits
  * @{
  */
/** RCC_Calibration limits*/
#define IS_RCC_HSICALIBRATION_VALUE(VALUE) ((VALUE) <= 0x7FU)
#define IS_RCC_CSICALIBRATION_VALUE(VALUE) ((VALUE) <= 0x1FU)
/**
  * @}
  */

/** @defgroup RCC_LSEDrive_Config RCC_LSEDrive_Config
  * @{
  */
#define RCC_LSEDRIVE_LOW                 0U                     /*!< LSE low drive capability */
#define RCC_LSEDRIVE_MEDIUMLOW           RCC_BDCR_LSEDRV_0      /*!< LSE medium low drive capability */
#define RCC_LSEDRIVE_MEDIUMHIGH          RCC_BDCR_LSEDRV_1      /*!< LSE medium high drive capability */
#define RCC_LSEDRIVE_HIGH                (RCC_BDCR_LSEDRV_1 | RCC_BDCR_LSEDRV_0)      /*!< LSE high drive capability */

#define IS_RCC_LSEDRIVE(VALUE) (((VALUE) == RCC_LSEDRIVE_LOW) || ((VALUE) == RCC_LSEDRIVE_MEDIUMLOW) || \
                                ((VALUE) == RCC_LSEDRIVE_MEDIUMHIGH) || ((VALUE) == RCC_LSEDRIVE_HIGH))
/**
  * @}
  */


/** @defgroup RCC_Interrupt RCC_Interrupt
  * @{
  */

#ifdef CORE_CA7
#define RCC_IT_LSIRDY                  RCC_MP_CIFR_LSIRDYF
#define RCC_IT_LSERDY                  RCC_MP_CIFR_LSERDYF
#define RCC_IT_HSIRDY                  RCC_MP_CIFR_HSIRDYF
#define RCC_IT_HSERDY                  RCC_MP_CIFR_HSERDYF
#define RCC_IT_CSIRDY                  RCC_MP_CIFR_CSIRDYF
#define RCC_IT_PLLRDY                  RCC_MP_CIFR_PLL1DYF
#define RCC_IT_PLL2RDY                 RCC_MP_CIFR_PLL2DYF
#define RCC_IT_PLL3RDY                 RCC_MP_CIFR_PLL3DYF
#define RCC_IT_PLL4RDY                 RCC_MP_CIFR_PLL4DYF
#define RCC_IT_LSECSS                  RCC_MP_CIFR_LSECSSF
#define RCC_IT_WKUP                    RCC_MP_CIFR_WKUPF
#endif /* CORE_CA7 */

