zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
#define RCC_IT_ALL  (RCC_IT_LSIRDY | RCC_IT_LSERDY | RCC_IT_HSIRDY | \
                     RCC_IT_HSERDY | RCC_IT_CSIRDY | RCC_IT_PLLRDY | \
                     RCC_IT_PLL2RDY | RCC_IT_PLL3RDY | RCC_IT_PLL4RDY | \
                     RCC_IT_LSECSS | RCC_IT_WKUP)

#define IS_RCC_IT(VALUE) (((VALUE) == RCC_IT_LSIRDY) || ((VALUE) == RCC_IT_LSERDY) || \
                          ((VALUE) == RCC_IT_HSIRDY) || ((VALUE) == RCC_IT_HSERDY) || \
                          ((VALUE) == RCC_IT_CSIRDY) || ((VALUE) == RCC_IT_PLLRDY) || \
                          ((VALUE) == RCC_IT_PLL2RDY) || ((VALUE) == RCC_IT_PLL3RDY) || \
                          ((VALUE) == RCC_IT_PLL4RDY) || ((VALUE) == RCC_IT_LSECSS) || \
                          ((VALUE) == RCC_IT_WKUP))

/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/** @defgroup RCC_Exported_Macros RCC_Exported_Macros
  * @{
  */
/** @brief  Force or release the APB1 peripheral reset */
#define __HAL_RCC_APB1_FORCE_RESET()      (RCC->APB1RSTSETR = 0x46F9A3FU)
#define __HAL_RCC_TIM2_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_TIM2RST)
#define __HAL_RCC_TIM3_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_TIM3RST)
#define __HAL_RCC_TIM4_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_TIM4RST)
#define __HAL_RCC_TIM5_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_TIM5RST)
#define __HAL_RCC_TIM6_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_TIM6RST)
#define __HAL_RCC_TIM7_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_TIM7RST)
#define __HAL_RCC_LPTIM1_FORCE_RESET()    (RCC->APB1RSTSETR = RCC_APB1RSTSETR_LPTIM1RST)
#define __HAL_RCC_SPI2_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_SPI2RST)
#define __HAL_RCC_SPI3_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_SPI3RST)
#define __HAL_RCC_USART3_FORCE_RESET()    (RCC->APB1RSTSETR = RCC_APB1RSTSETR_USART3RST)
#define __HAL_RCC_UART4_FORCE_RESET()     (RCC->APB1RSTSETR = RCC_APB1RSTSETR_UART4RST)
#define __HAL_RCC_UART5_FORCE_RESET()     (RCC->APB1RSTSETR = RCC_APB1RSTSETR_UART5RST)
#define __HAL_RCC_UART7_FORCE_RESET()     (RCC->APB1RSTSETR = RCC_APB1RSTSETR_UART7RST)
#define __HAL_RCC_UART8_FORCE_RESET()     (RCC->APB1RSTSETR = RCC_APB1RSTSETR_UART8RST)
#define __HAL_RCC_I2C1_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_I2C1RST)
#define __HAL_RCC_I2C2_FORCE_RESET()      (RCC->APB1RSTSETR = RCC_APB1RSTSETR_I2C2RST)
#define __HAL_RCC_SPDIFRX_FORCE_RESET()   (RCC->APB1RSTSETR = RCC_APB1RSTSETR_SPDIFRST)

#define __HAL_RCC_APB1_RELEASE_RESET()    (RCC->APB1RSTCLRR = 0x46F9A3FU)
#define __HAL_RCC_TIM2_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_TIM2RST)
#define __HAL_RCC_TIM3_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_TIM3RST)
#define __HAL_RCC_TIM4_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_TIM4RST)
#define __HAL_RCC_TIM5_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_TIM5RST)
#define __HAL_RCC_TIM6_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_TIM6RST)
#define __HAL_RCC_TIM7_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_TIM7RST)
#define __HAL_RCC_LPTIM1_RELEASE_RESET()  (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_LPTIM1RST)
#define __HAL_RCC_SPI2_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_SPI2RST)
#define __HAL_RCC_SPI3_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_SPI3RST)
#define __HAL_RCC_USART3_RELEASE_RESET()  (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_USART3RST)
#define __HAL_RCC_UART4_RELEASE_RESET()   (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_UART4RST)
#define __HAL_RCC_UART5_RELEASE_RESET()   (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_UART5RST)
#define __HAL_RCC_UART7_RELEASE_RESET()   (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_UART7RST)
#define __HAL_RCC_UART8_RELEASE_RESET()   (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_UART8RST)
#define __HAL_RCC_I2C1_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_I2C1RST)
#define __HAL_RCC_I2C2_RELEASE_RESET()    (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_I2C2RST)
#define __HAL_RCC_SPDIFRX_RELEASE_RESET() (RCC->APB1RSTCLRR = RCC_APB1RSTCLRR_SPDIFRST)

/** @brief  Force or release the APB2 peripheral reset. */
#define __HAL_RCC_APB2_FORCE_RESET()      (RCC->APB2RSTSETR = 0x1132103U)
#define __HAL_RCC_TIM1_FORCE_RESET()      (RCC->APB2RSTSETR = RCC_APB2RSTSETR_TIM1RST)
#define __HAL_RCC_TIM8_FORCE_RESET()      (RCC->APB2RSTSETR = RCC_APB2RSTSETR_TIM8RST)
#define __HAL_RCC_SPI1_FORCE_RESET()      (RCC->APB2RSTSETR = RCC_APB2RSTSETR_SPI1RST)
#define __HAL_RCC_USART6_FORCE_RESET()    (RCC->APB2RSTSETR = RCC_APB2RSTSETR_USART6RST)
#define __HAL_RCC_SAI1_FORCE_RESET()      (RCC->APB2RSTSETR = RCC_APB2RSTSETR_SAI1RST)
#define __HAL_RCC_SAI2_FORCE_RESET()      (RCC->APB2RSTSETR = RCC_APB2RSTSETR_SAI2RST)
#define __HAL_RCC_DFSDM1_FORCE_RESET()    (RCC->APB2RSTSETR = RCC_APB2RSTSETR_DFSDMRST)
#define __HAL_RCC_FDCAN_FORCE_RESET()     (RCC->APB2RSTSETR = RCC_APB2RSTSETR_FDCANRST)

#define __HAL_RCC_APB2_RELEASE_RESET()    (RCC->APB2RSTCLRR = 0x1132103U)
#define __HAL_RCC_TIM1_RELEASE_RESET()    (RCC->APB2RSTCLRR = RCC_APB2RSTCLRR_TIM1RST)
#define __HAL_RCC_TIM8_RELEASE_RESET()    (RCC->APB2RSTCLRR = RCC_APB2RSTCLRR_TIM8RST)
#define __HAL_RCC_SPI1_RELEASE_RESET()    (RCC->APB2RSTCLRR = RCC_APB2RSTCLRR_SPI1RST)
#define __HAL_RCC_USART6_RELEASE_RESET()  (RCC->APB2RSTCLRR = RCC_APB2RSTCLRR_USART6RST)
#define __HAL_RCC_SAI1_RELEASE_RESET()    (RCC->APB2RSTCLRR = RCC_APB2RSTCLRR_SAI1RST)
#define __HAL_RCC_SAI2_RELEASE_RESET()    (RCC->APB2RSTCLRR = RCC_APB2RSTCLRR_SAI2RST)
#define __HAL_RCC_DFSDM1_RELEASE_RESET()  (RCC->APB2RSTCLRR = RCC_APB2RSTCLRR_DFSDMRST)
#define __HAL_RCC_FDCAN_RELEASE_RESET()   (RCC->APB2RSTCLRR = RCC_APB2RSTCLRR_FDCANRST)

/** @brief  Force or release the APB3 peripheral reset. */
#define __HAL_RCC_APB3_FORCE_RESET()      (RCC->APB3RSTSETR = 0x0001280FU)
#define __HAL_RCC_LPTIM2_FORCE_RESET()    (RCC->APB3RSTSETR = RCC_APB3RSTSETR_LPTIM2RST)
#define __HAL_RCC_LPTIM3_FORCE_RESET()    (RCC->APB3RSTSETR = RCC_APB3RSTSETR_LPTIM3RST)
#define __HAL_RCC_LPTIM4_FORCE_RESET()    (RCC->APB3RSTSETR = RCC_APB3RSTSETR_LPTIM4RST)
#define __HAL_RCC_LPTIM5_FORCE_RESET()    (RCC->APB3RSTSETR = RCC_APB3RSTSETR_LPTIM5RST)
#define __HAL_RCC_SYSCFG_FORCE_RESET()    (RCC->APB3RSTSETR = RCC_APB3RSTSETR_SYSCFGRST)
#define __HAL_RCC_VREF_FORCE_RESET()      (RCC->APB3RSTSETR = RCC_APB3RSTSETR_VREFRST)
#define __HAL_RCC_DTS_FORCE_RESET()       (RCC->APB3RSTSETR = RCC_APB3RSTSETR_DTSRST)

#define __HAL_RCC_APB3_RELEASE_RESET()    (RCC->APB3RSTCLRR = 0x0001280FU)
#define __HAL_RCC_LPTIM2_RELEASE_RESET()  (RCC->APB3RSTCLRR = RCC_APB3RSTCLRR_LPTIM2RST)
#define __HAL_RCC_LPTIM3_RELEASE_RESET()  (RCC->APB3RSTCLRR = RCC_APB3RSTCLRR_LPTIM3RST)
#define __HAL_RCC_LPTIM4_RELEASE_RESET()  (RCC->APB3RSTCLRR = RCC_APB3RSTCLRR_LPTIM4RST)
#define __HAL_RCC_LPTIM5_RELEASE_RESET()  (RCC->APB3RSTCLRR = RCC_APB3RSTCLRR_LPTIM5RST)
#define __HAL_RCC_SYSCFG_RELEASE_RESET()  (RCC->APB3RSTCLRR = RCC_APB3RSTCLRR_SYSCFGRST)
#define __HAL_RCC_VREF_RELEASE_RESET()    (RCC->APB3RSTCLRR = RCC_APB3RSTCLRR_VREFRST)
#define __HAL_RCC_DTS_RELEASE_RESET()     (RCC->APB3RSTCLRR = RCC_APB3RSTCLRR_DTSRST)

/** @brief  Force or release the AHB2 peripheral reset. */
#define __HAL_RCC_AHB2_FORCE_RESET()      (RCC->AHB2RSTSETR = 0x0000017FU)
#define __HAL_RCC_DMA1_FORCE_RESET()      (RCC->AHB2RSTSETR = RCC_AHB2RSTSETR_DMA1RST)
#define __HAL_RCC_DMA2_FORCE_RESET()      (RCC->AHB2RSTSETR = RCC_AHB2RSTSETR_DMA2RST)
#if defined(RCC_AHB2RSTSETR_DMAMUX1RST)
#define __HAL_RCC_DMAMUX1_FORCE_RESET()   (RCC->AHB2RSTSETR = RCC_AHB2RSTSETR_DMAMUX1RST)
#endif /* RCC_AHB2RSTSETR_DMAMUX1RST */
#if defined(RCC_AHB2RSTSETR_DMA3RST)
#define __HAL_RCC_DMA3_FORCE_RESET()      (RCC->AHB2RSTSETR = RCC_AHB2RSTSETR_DMA3RST)
#endif /* RCC_AHB2RSTSETR_DMA3RST */
#if defined(RCC_AHB2RSTSETR_DMAMUX2RST)
#define __HAL_RCC_DMAMUX2_FORCE_RESET()   (RCC->AHB2RSTSETR = RCC_AHB2RSTSETR_DMAMUX2RST)
#endif /* RCC_AHB2RSTSETR_DMAMUX2RST */
#if defined(RCC_AHB2RSTSETR_ADC1RST)
#define __HAL_RCC_ADC1_FORCE_RESET()      (RCC->AHB2RSTSETR = RCC_AHB2RSTSETR_ADC1RST)
#endif /* RCC_AHB2RSTSETR_ADC1RST */
#if defined(RCC_AHB2RSTSETR_ADC2RST)
#define __HAL_RCC_ADC2_FORCE_RESET()      (RCC->AHB2RSTSETR = RCC_AHB2RSTSETR_ADC2RST)
#endif /* RCC_AHB2RSTSETR_ADC2RST */
#define __HAL_RCC_USBO_FORCE_RESET()      (RCC->AHB2RSTSETR = RCC_AHB2RSTSETR_USBORST)

#define __HAL_RCC_AHB2_RELEASE_RESET()    (RCC->AHB2RSTCLRR = 0x0000017FU)
#define __HAL_RCC_DMA1_RELEASE_RESET()    (RCC->AHB2RSTCLRR = RCC_AHB2RSTCLRR_DMA1RST)
#define __HAL_RCC_DMA2_RELEASE_RESET()    (RCC->AHB2RSTCLRR = RCC_AHB2RSTCLRR_DMA2RST)
#if defined(RCC_AHB2RSTCLRR_DMAMUX1RST)
#define __HAL_RCC_DMAMUX1_RELEASE_RESET() (RCC->AHB2RSTCLRR = RCC_AHB2RSTCLRR_DMAMUX1RST)
#endif /* RCC_AHB2RSTCLRR_DMAMUX1RST */
#if defined(RCC_AHB2RSTCLRR_DMA3RST)
#define __HAL_RCC_DMA3_RELEASE_RESET()    (RCC->AHB2RSTCLRR = RCC_AHB2RSTCLRR_DMA3RST)
#endif /* RCC_AHB2RSTCLRR_DMA3RST */
#if defined(RCC_AHB2RSTCLRR_DMAMUX2RST)
#define __HAL_RCC_DMAMUX2_RELEASE_RESET() (RCC->AHB2RSTCLRR = RCC_AHB2RSTCLRR_DMAMUX2RST)
#endif /* RCC_AHB2RSTCLRR_DMAMUX2RST */
#if defined(RCC_AHB2RSTCLRR_ADC1RST)
#define __HAL_RCC_ADC1_RELEASE_RESET()    (RCC->AHB2RSTCLRR = RCC_AHB2RSTCLRR_ADC1RST)
#endif /* RCC_AHB2RSTCLRR_ADC1RST */
#if defined(RCC_AHB2RSTCLRR_ADC2RST)
#define __HAL_RCC_ADC2_RELEASE_RESET()    (RCC->AHB2RSTCLRR = RCC_AHB2RSTCLRR_ADC2RST)
#endif /* RCC_AHB2RSTCLRR_ADC2RST */
#define __HAL_RCC_USBO_RELEASE_RESET()    (RCC->AHB2RSTCLRR = RCC_AHB2RSTCLRR_USBORST)

/** @brief  Force or release the AHB4 peripheral reset. */
#define __HAL_RCC_AHB4_FORCE_RESET()      (RCC->AHB4RSTSETR = 0x000081FFU)
#define __HAL_RCC_GPIOA_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIOARST)
#define __HAL_RCC_GPIOB_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIOBRST)
#define __HAL_RCC_GPIOC_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIOCRST)
#define __HAL_RCC_GPIOD_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIODRST)
#define __HAL_RCC_GPIOE_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIOERST)
#define __HAL_RCC_GPIOF_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIOFRST)
#define __HAL_RCC_GPIOG_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIOGRST)
#define __HAL_RCC_GPIOH_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIOHRST)
#define __HAL_RCC_GPIOI_FORCE_RESET()     (RCC->AHB4RSTSETR = RCC_AHB4RSTSETR_GPIOIRST)

#define __HAL_RCC_AHB4_RELEASE_RESET()    (RCC->AHB4RSTCLRR = 0x000081FFU)
#define __HAL_RCC_GPIOA_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIOARST)
#define __HAL_RCC_GPIOB_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIOBRST)
#define __HAL_RCC_GPIOC_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIOCRST)
#define __HAL_RCC_GPIOD_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIODRST)
#define __HAL_RCC_GPIOE_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIOERST)
#define __HAL_RCC_GPIOF_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIOFRST)
#define __HAL_RCC_GPIOG_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIOGRST)
#define __HAL_RCC_GPIOH_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIOHRST)
#define __HAL_RCC_GPIOI_RELEASE_RESET()   (RCC->AHB4RSTCLRR = RCC_AHB4RSTCLRR_GPIOIRST)

/** @brief  Force or release the APB4 peripheral reset. */
#define __HAL_RCC_APB4_FORCE_RESET()      (RCC->APB4RSTSETR = 0x00010103U)
#define __HAL_RCC_LTDC_FORCE_RESET()      (RCC->APB4RSTSETR = RCC_APB4RSTSETR_LTDCRST)
#define __HAL_RCC_DCMIPP_FORCE_RESET()    (RCC->APB4RSTSETR = RCC_APB4RSTSETR_DCMIPPRST)
#define __HAL_RCC_DDRPERFM_FORCE_RESET()  (RCC->APB4RSTSETR = RCC_APB4RSTSETR_DDRPERFMRST)
#define __HAL_RCC_USBPHY_FORCE_RESET()    (RCC->APB4RSTSETR = RCC_APB4RSTSETR_USBPHYRST)

#define __HAL_RCC_APB4_RELEASE_RESET()    (RCC->APB4RSTCLRR = 0x00010103U)
#define __HAL_RCC_LTDC_RELEASE_RESET()    (RCC->APB4RSTCLRR = RCC_APB4RSTCLRR_LTDCRST)
#define __HAL_RCC_DCMIPP_RELEASE_RESET()  (RCC->APB4RSTCLRR = RCC_APB4RSTCLRR_DCMIPPRST)
#define __HAL_RCC_DDRPERFM_RELEASE_RESET() (RCC->APB4RSTCLRR = RCC_APB4RSTCLRR_DDRPERFMRST)
#define __HAL_RCC_USBPHY_RELEASE_RESET()  (RCC->APB4RSTCLRR = RCC_APB4RSTCLRR_USBPHYRST)

/** @brief  Force or release the APB5 peripheral reset. */
/** @note   Note that when the secure mode is enabled, only secure accesses can
  *          reset the peripherals connected to APB5.
  */
#define __HAL_RCC_APB5_FORCE_RESET()      (RCC->APB5RSTSETR = 0x00100000U)
#define __HAL_RCC_STGEN_FORCE_RESET()     (RCC->APB5RSTSETR = RCC_APB5RSTSETR_STGENRST)

#define __HAL_RCC_APB5_RELEASE_RESET()    (RCC->APB5RSTCLRR = 0x00100000U)
#define __HAL_RCC_STGEN_RELEASE_RESET()   (RCC->APB5RSTCLRR = RCC_APB5RSTCLRR_STGENRST)


/** @brief  Force or release the APB6 peripheral reset. */
/** @note   Note that when the secure mode is enabled, only secure accesses can
  *          reset the peripherals connected to APB6.
  */
#define __HAL_RCC_APB6_FORCE_RESET()      (RCC->APB6RSTSETR = 0x0001FFFU)
#if defined(RCC_APB6RSTSETR_TIM17RST)
#define __HAL_RCC_TIM17_FORCE_RESET()     (RCC->APB6RSTSETR = RCC_APB6RSTSETR_TIM17RST)
#endif /* RCC_APB6RSTSETR_TIM17RST */
#if defined(RCC_APB6RSTSETR_TIM16RST)
#define __HAL_RCC_TIM16_FORCE_RESET()     (RCC->APB6RSTSETR = RCC_APB6RSTSETR_TIM16RST)
#endif /* RCC_APB6RSTSETR_TIM16RST */
#if defined(RCC_APB6RSTSETR_TIM15RST)
#define __HAL_RCC_TIM15_FORCE_RESET()     (RCC->APB6RSTSETR = RCC_APB6RSTSETR_TIM15RST)
#endif /* RCC_APB6RSTSETR_TIM15RST */
#if defined(RCC_APB6RSTSETR_TIM14RST)
#define __HAL_RCC_TIM14_FORCE_RESET()     (RCC->APB6RSTSETR = RCC_APB6RSTSETR_TIM14RST)
#endif /* RCC_APB6RSTSETR_TIM14RST */
#if defined(RCC_APB6RSTSETR_TIM13RST)
#define __HAL_RCC_TIM13_FORCE_RESET()     (RCC->APB6RSTSETR = RCC_APB6RSTSETR_TIM13RST)
#endif /* RCC_APB6RSTSETR_TIM13RST */
#if defined(RCC_APB6RSTSETR_TIM12RST)
#define __HAL_RCC_TIM12_FORCE_RESET()     (RCC->APB6RSTSETR = RCC_APB6RSTSETR_TIM12RST)
#endif /* RCC_APB6RSTSETR_TIM12RST */
#if defined(RCC_APB6RSTSETR_I2C5RST)
#define __HAL_RCC_I2C5_FORCE_RESET()      (RCC->APB6RSTSETR = RCC_APB6RSTSETR_I2C5RST)
#endif /* RCC_APB6RSTSETR_I2C5RST */
#if defined(RCC_APB6RSTSETR_I2C4RST)
#define __HAL_RCC_I2C4_FORCE_RESET()      (RCC->APB6RSTSETR = RCC_APB6RSTSETR_I2C4RST)
#endif /* RCC_APB6RSTSETR_I2C4RST */
#if defined(RCC_APB6RSTSETR_I2C3RST)
#define __HAL_RCC_I2C3_FORCE_RESET()      (RCC->APB6RSTSETR = RCC_APB6RSTSETR_I2C3RST)
#endif /* RCC_APB6RSTSETR_I2C3RST */
#if defined(RCC_APB6RSTSETR_SPI5RST)
#define __HAL_RCC_SPI5_FORCE_RESET()      (RCC->APB6RSTSETR = RCC_APB6RSTSETR_SPI5RST)
#endif /* RCC_APB6RSTSETR_SPI5RST */
#if defined(RCC_APB6RSTSETR_SPI4RST)
#define __HAL_RCC_SPI4_FORCE_RESET()      (RCC->APB6RSTSETR = RCC_APB6RSTSETR_SPI4RST)
#endif /* RCC_APB6RSTSETR_SPI4RST */
#if defined(RCC_APB6RSTSETR_USART2RST)
#define __HAL_RCC_USART2_FORCE_RESET()    (RCC->APB6RSTSETR = RCC_APB6RSTSETR_USART2RST)
#endif /* RCC_APB6RSTSETR_USART2RST */
#if defined(RCC_APB6RSTSETR_USART1RST)
#define __HAL_RCC_USART1_FORCE_RESET()    (RCC->APB6RSTSETR = RCC_APB6RSTSETR_USART1RST)
#endif /* RCC_APB6RSTSETR_USART1RST */

#define __HAL_RCC_APB6_RELEASE_RESET()    (RCC->APB6RSTCLRR = 0x0001FFFU)
#if defined(RCC_APB6RSTCLRR_TIM17RST)
#define __HAL_RCC_TIM17_RELEASE_RESET()   (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_TIM17RST)
#endif /* RCC_APB6RSTCLRR_TIM17RST */
#if defined(RCC_APB6RSTCLRR_TIM16RST)
#define __HAL_RCC_TIM16_RELEASE_RESET()   (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_TIM16RST)
#endif /* RCC_APB6RSTCLRR_TIM16RST */
#if defined(RCC_APB6RSTCLRR_TIM15RST)
#define __HAL_RCC_TIM15_RELEASE_RESET()   (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_TIM15RST)
#endif /* RCC_APB6RSTCLRR_TIM15RST */
#if defined(RCC_APB6RSTCLRR_TIM14RST)
#define __HAL_RCC_TIM14_RELEASE_RESET()   (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_TIM14RST)
#endif /* RCC_APB6RSTCLRR_TIM14RST */
#if defined(RCC_APB6RSTCLRR_TIM13RST)
#define __HAL_RCC_TIM13_RELEASE_RESET()   (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_TIM13RST)
#endif /* RCC_APB6RSTCLRR_TIM13RST */
#if defined(RCC_APB6RSTCLRR_TIM12RST)
#define __HAL_RCC_TIM12_RELEASE_RESET()   (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_TIM12RST)
#endif /* RCC_APB6RSTCLRR_TIM12RST */
#if defined(RCC_APB6RSTCLRR_I2C5RST)
#define __HAL_RCC_I2C5_RELEASE_RESET()    (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_I2C5RST)
#endif /* RCC_APB6RSTCLRR_I2C5RST */
#if defined(RCC_APB6RSTCLRR_I2C4RST)
#define __HAL_RCC_I2C4_RELEASE_RESET()    (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_I2C4RST)
#endif /* RCC_APB6RSTCLRR_I2C4RST */
#if defined(RCC_APB6RSTCLRR_I2C3RST)
#define __HAL_RCC_I2C3_RELEASE_RESET()    (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_I2C3RST)
#endif /* RCC_APB6RSTCLRR_I2C3RST */
#if defined(RCC_APB6RSTCLRR_SPI5RST)
#define __HAL_RCC_SPI5_RELEASE_RESET()    (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_SPI5RST)
#endif /* RCC_APB6RSTCLRR_SPI5RST */
#if defined(RCC_APB6RSTCLRR_SPI4RST)
#define __HAL_RCC_SPI4_RELEASE_RESET()    (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_SPI4RST)
#endif /* RCC_APB6RSTCLRR_SPI4RST */
#if defined(RCC_APB6RSTCLRR_USART2RST)
#define __HAL_RCC_USART2_RELEASE_RESET()  (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_USART2RST)
#endif /* RCC_APB6RSTCLRR_USART2RST */
#if defined(RCC_APB6RSTCLRR_USART1RST)
#define __HAL_RCC_USART1_RELEASE_RESET()  (RCC->APB6RSTCLRR = RCC_APB6RSTCLRR_USART1RST)
#endif /* RCC_APB6RSTCLRR_USART1RST */

/** @brief  Force or release the AHB5 peripheral reset. */
#if defined(CRYP1)
#define __HAL_RCC_CRYP1_FORCE_RESET()     (RCC->AHB5RSTSETR = RCC_AHB5RSTSETR_CRYP1RST)
#endif /* CRYP1 */
#define __HAL_RCC_AHB5_FORCE_RESET()      (RCC->AHB5RSTSETR = 0x0001007CU)
#if defined(SAES)
#define __HAL_RCC_SAES_FORCE_RESET()      (RCC->AHB5RSTSETR = RCC_AHB5RSTSETR_SAESRST)
#endif /* SAES */
#if defined(PKA)
#define __HAL_RCC_PKA_FORCE_RESET()       (RCC->AHB5RSTSETR = RCC_AHB5RSTSETR_PKARST)
#endif /* PKA */
#define __HAL_RCC_HASH1_FORCE_RESET()     (RCC->AHB5RSTSETR = RCC_AHB5RSTSETR_HASH1RST)
#define __HAL_RCC_RNG1_FORCE_RESET()      (RCC->AHB5RSTSETR = RCC_AHB5RSTSETR_RNG1RST)
#define __HAL_RCC_AXIMC_FORCE_RESET()     (RCC->AHB5RSTSETR = RCC_AHB5RSTSETR_AXIMCRST)

#if defined(CRYP1)
#define __HAL_RCC_CRYP1_RELEASE_RESET()   (RCC->AHB5RSTCLRR = RCC_AHB5RSTCLRR_CRYP1RST)
#endif /* CRYP1 */
#define __HAL_RCC_AHB5_RELEASE_RESET()    (RCC->AHB5RSTCLRR = 0x0001007CU)
#if defined(SAES)
#define __HAL_RCC_SAES_RELEASE_RESET()    (RCC->AHB5RSTCLRR = RCC_AHB5RSTCLRR_SAESRST)
#endif /* SAES */
#if defined(PKA)
#define __HAL_RCC_PKA_RELEASE_RESET()     (RCC->AHB5RSTCLRR = RCC_AHB5RSTCLRR_PKARST)
#endif /* PKA */
#define __HAL_RCC_HASH1_RELEASE_RESET()   (RCC->AHB5RSTCLRR = RCC_AHB5RSTCLRR_HASH1RST)
#define __HAL_RCC_RNG1_RELEASE_RESET()    (RCC->AHB5RSTCLRR = RCC_AHB5RSTCLRR_RNG1RST)
#define __HAL_RCC_AXIMC_RELEASE_RESET()   (RCC->AHB5RSTCLRR = RCC_AHB5RSTCLRR_AXIMCRST)

/** @brief  Force or release the AHB6 peripheral reset. */
#define __HAL_RCC_AHB6_FORCE_RESET()      (RCC->AHB6RSTSETR = 0x41135403U))
#define __HAL_RCC_MDMA_FORCE_RESET()      (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_MDMARST)
#define __HAL_RCC_MCE_FORCE_RESET()       (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_MCERST)
#if defined(RCC_AHB6RSTSETR_ETH1MACRST)
#define __HAL_RCC_ETH1MAC_FORCE_RESET()   (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_ETH1MACRST)
#endif /* RCC_AHB6RSTSETR_ETH1MACRST */
#if defined(RCC_AHB6RSTSETR_ETH2MACRST)
#define __HAL_RCC_ETH2MAC_FORCE_RESET()   (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_ETH2MACRST)
#endif /* RCC_AHB6RSTSETR_ETH2MACRST */
#define __HAL_RCC_FMC_FORCE_RESET()       (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_FMCRST)
#define __HAL_RCC_QSPI_FORCE_RESET()      (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_QSPIRST)
#define __HAL_RCC_SDMMC1_FORCE_RESET()    (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_SDMMC1RST)
#define __HAL_RCC_SDMMC2_FORCE_RESET()    (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_SDMMC2RST)
#define __HAL_RCC_CRC1_FORCE_RESET()      (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_CRC1RST)
#define __HAL_RCC_USBH_FORCE_RESET()      (RCC->AHB6RSTSETR = RCC_AHB6RSTSETR_USBHRST)

/** @note __HAL_RCC_GPU_RELEASE_RESET does not exist as GPU reset process may
  *        take several clock cycles, for that purpose, the application can
  *        read-back the reset bit RCC_AHB6RSTSETR_GPURST in order to check if
  *        the reset process is on-going or completed after setting
  *        RCC_AHB6RSTSETR_GPURST
  */
#define __HAL_RCC_AHB6_RELEASE_RESET()    (RCC->AHB6RSTCLRR = 0x41135403U)
#define __HAL_RCC_MDMA_RELEASE_RESET()    (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_MDMARST)
#define __HAL_RCC_MCE_RELEASE_RESET()     (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_MCERST)
#if defined(RCC_AHB6RSTCLRR_ETH1MACRST)
#define __HAL_RCC_ETH1MAC_RELEASE_RESET() (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_ETH1MACRST)
#endif /* RCC_AHB6RSTCLRR_ETH1MACRST */
#if defined(RCC_AHB6RSTCLRR_ETH2MACRST)
#define __HAL_RCC_ETH2MAC_RELEASE_RESET() (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_ETH2MACRST)
#endif /* RCC_AHB6RSTCLRR_ETH2MACRST */
#define __HAL_RCC_FMC_RELEASE_RESET()     (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_FMCRST)
#define __HAL_RCC_QSPI_RELEASE_RESET()    (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_QSPIRST)
#define __HAL_RCC_SDMMC1_RELEASE_RESET()  (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_SDMMC1RST)
#define __HAL_RCC_SDMMC2_RELEASE_RESET()  (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_SDMMC2RST)
#define __HAL_RCC_CRC1_RELEASE_RESET()    (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_CRC1RST)
#define __HAL_RCC_USBH_RELEASE_RESET()    (RCC->AHB6RSTCLRR = RCC_AHB6RSTCLRR_USBHRST)


#ifdef CORE_CA7
/** @brief  Enable or disable the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral to the MPU.
  */
#define __HAL_RCC_TIM2_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_TIM2EN)
#define __HAL_RCC_TIM3_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_TIM3EN)
#define __HAL_RCC_TIM4_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_TIM4EN)
#define __HAL_RCC_TIM5_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_TIM5EN)
#define __HAL_RCC_TIM6_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_TIM6EN)
#define __HAL_RCC_TIM7_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_TIM7EN)
#define __HAL_RCC_LPTIM1_CLK_ENABLE()     (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_LPTIM1EN)
#define __HAL_RCC_SPI2_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_SPI2EN)
#define __HAL_RCC_SPI3_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_SPI3EN)
#define __HAL_RCC_USART3_CLK_ENABLE()     (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_USART3EN)
#define __HAL_RCC_UART4_CLK_ENABLE()      (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_UART4EN)
#define __HAL_RCC_UART5_CLK_ENABLE()      (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_UART5EN)
#define __HAL_RCC_UART7_CLK_ENABLE()      (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_UART7EN)
#define __HAL_RCC_UART8_CLK_ENABLE()      (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_UART8EN)
#define __HAL_RCC_I2C1_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_I2C1EN)
#define __HAL_RCC_I2C2_CLK_ENABLE()       (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_I2C2EN)
#define __HAL_RCC_SPDIFRX_CLK_ENABLE()    (RCC->MP_APB1ENSETR = RCC_MP_APB1ENSETR_SPDIFEN)

