zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
#if defined(DCMIPP)
#define __HAL_RCC_DCMIPP_CLK_DISABLE()    (RCC->MP_APB4ENCLRR = RCC_MP_APB4ENCLRR_DCMIPPEN)
#endif /* DCMIPP */
#define __HAL_RCC_DDRPERFM_CLK_DISABLE()  (RCC->MP_APB4ENCLRR = RCC_MP_APB4ENCLRR_DDRPERFMEN)
#define __HAL_RCC_IWDG2APB_CLK_DISABLE()  (RCC->MP_APB4ENCLRR = RCC_MP_APB4ENCLRR_IWDG2APBEN)
#define __HAL_RCC_USBPHY_CLK_DISABLE()    (RCC->MP_APB4ENCLRR = RCC_MP_APB4ENCLRR_USBPHYEN)
#define __HAL_RCC_STGENRO_CLK_DISABLE()   (RCC->MP_APB4ENCLRR = RCC_MP_APB4ENCLRR_STGENROEN)

/** @brief  Enable or disable the APB4 secure peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral.
  * @note   A write access to this register field must be secure. A read access may
  *         be secure or non-secure.
  */
#define __HAL_RCC_S_LTDC_CLK_ENABLE()     (RCC->MP_S_APB4ENSETR = RCC_MP_S_APB4ENSETR_LTDCEN)
#define __HAL_RCC_S_LTDC_CLK_DISABLE()    (RCC->MP_S_APB4ENCLRR = RCC_MP_S_APB4ENCLRR_LTDCEN)

/** @brief  Enable or disable the APB4 non-secure peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral.
  */
#if defined(RCC_MP_NS_APB4ENSETR_LTDCEN)
#define __HAL_RCC_LTDC_CLK_ENABLE()       (RCC->MP_NS_APB4ENSETR = RCC_MP_NS_APB4ENSETR_LTDCEN)
#endif /* RCC_MP_NS_APB4ENSETR_LTDCEN */
#if defined(RCC_MP_NS_APB4ENCLRR_LTDCEN)
#define __HAL_RCC_LTDC_CLK_DISABLE()      (RCC->MP_NS_APB4ENCLRR = RCC_MP_NS_APB4ENCLRR_LTDCEN)
#endif /* RCC_MP_NS_APB4ENCLRR_LTDCEN */

/** @brief  Enable or disable the APB5 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral to the MPU.
  */
#define __HAL_RCC_RTCAPB_CLK_ENABLE()     (RCC->MP_APB5ENSETR = RCC_MP_APB5ENSETR_RTCAPBEN)
#if defined(RCC_MP_APB5ENSETR_TZCEN)
#define __HAL_RCC_TZC_CLK_ENABLE()        (RCC->MP_APB5ENSETR = RCC_MP_APB5ENSETR_TZCEN)
#endif /* RCC_MP_APB5ENSETR_TZCEN */
#if defined(RCC_MP_APB5ENSETR_ETZPCEN)
#define __HAL_RCC_ETZPC_CLK_ENABLE()       (RCC->MP_APB5ENSETR = RCC_MP_APB5ENSETR_ETZPCEN)
#endif /* RCC_MP_APB5ENSETR_ETZPCEN */
#define __HAL_RCC_IWDG1APB_CLK_ENABLE()   (RCC->MP_APB5ENSETR = RCC_MP_APB5ENSETR_IWDG1APBEN)
#define __HAL_RCC_BSEC_CLK_ENABLE()       (RCC->MP_APB5ENSETR = RCC_MP_APB5ENSETR_BSECEN)
#if defined(RCC_MP_APB5ENSETR_STGENCEN)
#define __HAL_RCC_STGEN_CLK_ENABLE()      (RCC->MP_APB5ENSETR = RCC_MP_APB5ENSETR_STGENCEN)
#endif /* RCC_MP_APB5ENSETR_STGENCEN */

#define __HAL_RCC_RTCAPB_CLK_DISABLE()    (RCC->MP_APB5ENCLRR = RCC_MP_APB5ENCLRR_RTCAPBEN)
#if defined(RCC_MP_APB5ENCLRR_TZCEN)
#define __HAL_RCC_TZC_CLK_DISABLE()       (RCC->MP_APB5ENCLRR = RCC_MP_APB5ENCLRR_TZCEN)
#endif /* RCC_MP_APB5ENCLRR_TZCEN */
#if defined(RCC_MP_APB5ENCLRR_ETZPCEN)
#define __HAL_RCC_ETZPC_CLK_DISABLE()     (RCC->MP_APB5ENCLRR = RCC_MP_APB5ENCLRR_ETZPCEN)
#endif /* RCC_MP_APB5ENCLRR_ETZPCEN */
#define __HAL_RCC_IWDG1APB_CLK_DISABLE()  (RCC->MP_APB5ENCLRR = RCC_MP_APB5ENCLRR_IWDG1APBEN)
#define __HAL_RCC_BSEC_CLK_DISABLE()      (RCC->MP_APB5ENCLRR = RCC_MP_APB5ENCLRR_BSECEN)
#if defined(RCC_MP_APB5ENCLRR_STGENCEN)
#define __HAL_RCC_STGEN_CLK_DISABLE()     (RCC->MP_APB5ENCLRR = RCC_MP_APB5ENCLRR_STGENCEN)
#endif /* RCC_MP_APB5ENCLRR_STGENCEN */

/** @brief  Enable or disable the APB6 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral to the MPU.
  */
#if defined(RCC_MP_APB6ENSETR_USART1EN)
#define __HAL_RCC_USART1_CLK_ENABLE()     (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_USART1EN)
#endif /* RCC_MP_APB6ENSETR_USART1EN */
#if defined(RCC_MP_APB6ENSETR_USART2EN)
#define __HAL_RCC_USART2_CLK_ENABLE()     (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_USART2EN)
#endif /* RCC_MP_APB6ENSETR_USART2EN */
#if defined(RCC_MP_APB6ENSETR_SPI4EN)
#define __HAL_RCC_SPI4_CLK_ENABLE()       (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_SPI4EN)
#endif /* RCC_MP_APB6ENSETR_SPI4EN */
#if defined(RCC_MP_APB6ENSETR_SPI5EN)
#define __HAL_RCC_SPI5_CLK_ENABLE()       (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_SPI5EN)
#endif /* RCC_MP_APB6ENSETR_SPI5EN */
#if defined(RCC_MP_APB6ENSETR_I2C3EN)
#define __HAL_RCC_I2C3_CLK_ENABLE()       (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_I2C3EN)
#endif /* RCC_MP_APB6ENSETR_I2C3EN */
#if defined(RCC_MP_APB6ENSETR_I2C4EN)
#define __HAL_RCC_I2C4_CLK_ENABLE()       (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_I2C4EN)
#endif /* RCC_MP_APB6ENSETR_I2C4EN */
#if defined(RCC_MP_APB6ENSETR_I2C5EN)
#define __HAL_RCC_I2C5_CLK_ENABLE()       (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_I2C5EN)
#endif /* RCC_MP_APB6ENSETR_I2C5EN */
#if defined(RCC_MP_APB6ENSETR_TIM12EN)
#define __HAL_RCC_TIM12_CLK_ENABLE()      (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_TIM12EN)
#endif /* RCC_MP_APB6ENSETR_TIM12EN */
#if defined(RCC_MP_APB6ENSETR_TIM13EN)
#define __HAL_RCC_TIM13_CLK_ENABLE()      (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_TIM13EN)
#endif /* RCC_MP_APB6ENSETR_TIM13EN */
#if defined(RCC_MP_APB6ENSETR_TIM14EN)
#define __HAL_RCC_TIM14_CLK_ENABLE()      (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_TIM14EN)
#endif /* RCC_MP_APB6ENSETR_TIM14EN */
#if defined(RCC_MP_APB6ENSETR_TIM15EN)
#define __HAL_RCC_TIM15_CLK_ENABLE()      (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_TIM15EN)
#endif /* RCC_MP_APB6ENSETR_TIM15EN */
#if defined(RCC_MP_APB6ENSETR_TIM16EN)
#define __HAL_RCC_TIM16_CLK_ENABLE()      (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_TIM16EN)
#endif /* RCC_MP_APB6ENSETR_TIM16EN */
#if defined(RCC_MP_APB6ENSETR_TIM17EN)
#define __HAL_RCC_TIM17_CLK_ENABLE()      (RCC->MP_APB6ENSETR = RCC_MP_APB6ENSETR_TIM17EN)
#endif /* RCC_MP_APB6ENSETR_TIM17EN */

#if defined(RCC_MP_APB6ENCLRR_USART1EN)
#define __HAL_RCC_USART1_CLK_DISABLE()    (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_USART1EN)
#endif /* RCC_MP_APB6ENCLRR_USART1EN */
#if defined(RCC_MP_APB6ENCLRR_USART2EN)
#define __HAL_RCC_USART2_CLK_DISABLE()    (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_USART2EN)
#endif /* RCC_MP_APB6ENCLRR_USART2EN */
#if defined(RCC_MP_APB6ENCLRR_SPI4EN)
#define __HAL_RCC_SPI4_CLK_DISABLE()      (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_SPI4EN)
#endif /* RCC_MP_APB6ENCLRR_SPI4EN */
#if defined(RCC_MP_APB6ENCLRR_SPI5EN)
#define __HAL_RCC_SPI5_CLK_DISABLE()      (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_SPI5EN)
#endif /* RCC_MP_APB6ENCLRR_SPI5EN */
#if defined(RCC_MP_APB6ENCLRR_I2C3EN)
#define __HAL_RCC_I2C3_CLK_DISABLE()      (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_I2C3EN)
#endif /* RCC_MP_APB6ENCLRR_I2C3EN */
#if defined(RCC_MP_APB6ENCLRR_I2C4EN)
#define __HAL_RCC_I2C4_CLK_DISABLE()      (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_I2C4EN)
#endif /* RCC_MP_APB6ENCLRR_I2C4EN */
#if defined(RCC_MP_APB6ENCLRR_I2C5EN)
#define __HAL_RCC_I2C5_CLK_DISABLE()      (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_I2C5EN)
#endif /* RCC_MP_APB6ENCLRR_I2C5EN */
#if defined(RCC_MP_APB6ENCLRR_TIM12EN)
#define __HAL_RCC_TIM12_CLK_DISABLE()     (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_TIM12EN)
#endif /* RCC_MP_APB6ENCLRR_TIM12EN */
#if defined(RCC_MP_APB6ENCLRR_TIM13EN)
#define __HAL_RCC_TIM13_CLK_DISABLE()     (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_TIM13EN)
#endif /* RCC_MP_APB6ENCLRR_TIM13EN */
#if defined(RCC_MP_APB6ENCLRR_TIM14EN)
#define __HAL_RCC_TIM14_CLK_DISABLE()     (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_TIM14EN)
#endif /* RCC_MP_APB6ENCLRR_TIM14EN */
#if defined(RCC_MP_APB6ENCLRR_TIM15EN)
#define __HAL_RCC_TIM15_CLK_DISABLE()     (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_TIM15EN)
#endif /* RCC_MP_APB6ENCLRR_TIM15EN */
#if defined(RCC_MP_APB6ENCLRR_TIM16EN)
#define __HAL_RCC_TIM16_CLK_DISABLE()     (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_TIM16EN)
#endif /* RCC_MP_APB6ENCLRR_TIM16EN */
#if defined(RCC_MP_APB6ENCLRR_TIM17EN)
#define __HAL_RCC_TIM17_CLK_DISABLE()     (RCC->MP_APB6ENCLRR = RCC_MP_APB6ENCLRR_TIM17EN)
#endif /* RCC_MP_APB6ENCLRR_TIM17EN */

/** @brief  Enable or disable the AHB5 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral to the MPU.
  */
#if defined(PKA)
#define __HAL_RCC_PKA_CLK_ENABLE()        (RCC->MP_AHB5ENSETR = RCC_MP_AHB5ENSETR_PKAEN)
#endif /* PKA */
#if defined(SAES)
#define __HAL_RCC_SAES_CLK_ENABLE()       (RCC->MP_AHB5ENSETR = RCC_MP_AHB5ENSETR_SAESEN)
#endif /* SAES */
#if defined(CRYP1)
#define __HAL_RCC_CRYP1_CLK_ENABLE()      (RCC->MP_AHB5ENSETR = RCC_MP_AHB5ENSETR_CRYP1EN)
#endif /* CRYP1 */
#define __HAL_RCC_HASH1_CLK_ENABLE()      (RCC->MP_AHB5ENSETR = RCC_MP_AHB5ENSETR_HASH1EN)
#define __HAL_RCC_RNG1_CLK_ENABLE()       (RCC->MP_AHB5ENSETR = RCC_MP_AHB5ENSETR_RNG1EN)
#define __HAL_RCC_BKPSRAM_CLK_ENABLE()    (RCC->MP_AHB5ENSETR = RCC_MP_AHB5ENSETR_BKPSRAMEN)
#define __HAL_RCC_AXIMC_CLK_ENABLE()      (RCC->MP_AHB5ENSETR = RCC_MP_AHB5ENSETR_AXIMCEN)

