zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
#if defined(PKA)
#define __HAL_RCC_PKA_CLK_DISABLE()       (RCC->MP_AHB5ENCLRR = RCC_MP_AHB5ENCLRR_PKAEN)
#endif /* PKA */
#if defined(SAES)
#define __HAL_RCC_SAES_CLK_DISABLE()      (RCC->MP_AHB5ENCLRR = RCC_MP_AHB5ENCLRR_SAESEN)
#endif /* SAES */
#if defined(CRYP1)
#define __HAL_RCC_CRYP1_CLK_DISABLE()     (RCC->MP_AHB5ENCLRR = RCC_MP_AHB5ENCLRR_CRYP1EN)
#endif /* CRYP1 */
#define __HAL_RCC_HASH1_CLK_DISABLE()     (RCC->MP_AHB5ENCLRR = RCC_MP_AHB5ENCLRR_HASH1EN)
#define __HAL_RCC_RNG1_CLK_DISABLE()      (RCC->MP_AHB5ENCLRR = RCC_MP_AHB5ENCLRR_RNG1EN)
#define __HAL_RCC_BKPSRAM_CLK_DISABLE()   (RCC->MP_AHB5ENCLRR = RCC_MP_AHB5ENCLRR_BKPSRAMEN)
#define __HAL_RCC_AXIMC_CLK_DISABLE()     (RCC->MP_AHB5ENCLRR = RCC_MP_AHB5ENCLRR_AXIMCEN)

/** @brief  Enable or disable the AHB6 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral to the MPU.
  */
#if defined(RCC_MP_AHB6ENSETR_MCEEN)
#define __HAL_RCC_MCE_CLK_ENABLE()        (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_MCEEN)
#endif /* RCC_MP_AHB6ENSETR_MCEEN */
#if defined(RCC_MP_AHB6ENSETR_ETH1CKEN)
#define __HAL_RCC_ETH1CK_CLK_ENABLE()     (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_ETH1CKEN)
#endif /* RCC_MP_AHB6ENSETR_ETH1CKEN */
#if defined(RCC_MP_AHB6ENSETR_ETH2CKEN)
#define __HAL_RCC_ETH2CK_CLK_ENABLE()     (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_ETH2CKEN)
#endif /* RCC_MP_AHB6ENSETR_ETH2CKEN */
#if defined(RCC_MP_AHB6ENSETR_ETH1TXEN)
#define __HAL_RCC_ETH1TX_CLK_ENABLE()     (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_ETH1TXEN)
#endif /* RCC_MP_AHB6ENSETR_ETH1TXEN */
#if defined(RCC_MP_AHB6ENSETR_ETH2TXEN)
#define __HAL_RCC_ETH2TX_CLK_ENABLE()     (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_ETH2TXEN)
#endif /* RCC_MP_AHB6ENSETR_ETH2TXEN */
#if defined(RCC_MP_AHB6ENSETR_ETH1RXEN)
#define __HAL_RCC_ETH1RX_CLK_ENABLE()     (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_ETH1RXEN)
#endif /* RCC_MP_AHB6ENSETR_ETH1RXEN */
#if defined(RCC_MP_AHB6ENSETR_ETH2RXEN)
#define __HAL_RCC_ETH2RX_CLK_ENABLE()     (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_ETH2RXEN)
#endif /* RCC_MP_AHB6ENSETR_ETH2RXEN */
#if defined(RCC_MP_AHB6ENSETR_ETH1MACEN)
#define __HAL_RCC_ETH1MAC_CLK_ENABLE()    (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_ETH1MACEN)
#endif /* RCC_MP_AHB6ENSETR_ETH1MACEN */
#if defined(RCC_MP_AHB6ENSETR_ETH2MACEN)
#define __HAL_RCC_ETH2MAC_CLK_ENABLE()    (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_ETH2MACEN)
#endif /* RCC_MP_AHB6ENSETR_ETH2MACEN */
#define __HAL_RCC_FMC_CLK_ENABLE()        (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_FMCEN)
#define __HAL_RCC_QSPI_CLK_ENABLE()       (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_QSPIEN)
#define __HAL_RCC_SDMMC1_CLK_ENABLE()     (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_SDMMC1EN)
#define __HAL_RCC_SDMMC2_CLK_ENABLE()     (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_SDMMC2EN)
#define __HAL_RCC_CRC1_CLK_ENABLE()       (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_CRC1EN)
#define __HAL_RCC_USBH_CLK_ENABLE()       (RCC->MP_AHB6ENSETR = RCC_MP_AHB6ENSETR_USBHEN)

#if defined(RCC_MP_AHB6ENCLRR_MCEEN)
#define __HAL_RCC_MCE_CLK_DISABLE()       (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_MCEEN)
#endif /* RCC_MP_AHB6ENCLRR_MCEEN */
#if defined(RCC_MP_AHB6ENCLRR_ETH1CKEN)
#define __HAL_RCC_ETH1CK_CLK_DISABLE()    (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_ETH1CKEN)
#endif /* RCC_MP_AHB6ENCLRR_ETH1CKEN */
#if defined(RCC_MP_AHB6ENCLRR_ETH2CKEN)
#define __HAL_RCC_ETH2CK_CLK_DISABLE()    (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_ETH2CKEN)
#endif /* RCC_MP_AHB6ENCLRR_ETH2CKEN */
#if defined(RCC_MP_AHB6ENCLRR_ETH1TXEN)
#define __HAL_RCC_ETH1TX_CLK_DISABLE()    (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_ETH1TXEN)
#endif /* RCC_MP_AHB6ENCLRR_ETH1TXEN */
#if defined(RCC_MP_AHB6ENCLRR_ETH2TXEN)
#define __HAL_RCC_ETH2TX_CLK_DISABLE()    (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_ETH2TXEN)
#endif /* RCC_MP_AHB6ENCLRR_ETH2TXEN */
#if defined(RCC_MP_AHB6ENCLRR_ETH1RXEN)
#define __HAL_RCC_ETH1RX_CLK_DISABLE()    (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_ETH1RXEN)
#endif /* RCC_MP_AHB6ENCLRR_ETH1RXEN */
#if defined(RCC_MP_AHB6ENCLRR_ETH2RXEN)
#define __HAL_RCC_ETH2RX_CLK_DISABLE()    (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_ETH2RXEN)
#endif /* RCC_MP_AHB6ENCLRR_ETH2RXEN */
#if defined(RCC_MP_AHB6ENCLRR_ETH1MACEN)
#define __HAL_RCC_ETH1MAC_CLK_DISABLE()   (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_ETH1MACEN)
#endif /* RCC_MP_AHB6ENCLRR_ETH1MACEN */
#if defined(RCC_MP_AHB6ENCLRR_ETH2MACEN)
#define __HAL_RCC_ETH2MAC_CLK_DISABLE()   (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_ETH2MACEN)
#endif /* RCC_MP_AHB6ENCLRR_ETH2MACEN */
#define __HAL_RCC_FMC_CLK_DISABLE()       (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_FMCEN)
#define __HAL_RCC_QSPI_CLK_DISABLE()      (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_QSPIEN)
#define __HAL_RCC_SDMMC1_CLK_DISABLE()    (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_SDMMC1EN)
#define __HAL_RCC_SDMMC2_CLK_DISABLE()    (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_SDMMC2EN)
#define __HAL_RCC_CRC1_CLK_DISABLE()      (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_CRC1EN)
#define __HAL_RCC_USBH_CLK_DISABLE()      (RCC->MP_AHB6ENCLRR = RCC_MP_AHB6ENCLRR_USBHEN)

/** @brief  Enable or disable the AHB6 secure peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral.
  * @note   A write access to this register field must be secure. A read access may
  *         be secure or non-secure.
  */
#define __HAL_RCC_S_MDMA_CLK_ENABLE()     (RCC->MP_S_AHB6ENSETR = RCC_MP_S_AHB6ENSETR_MDMAEN)
#define __HAL_RCC_S_MDMA_CLK_DISABLE()    (RCC->MP_S_AHB6ENCLRR = RCC_MP_S_AHB6ENCLRR_MDMAEN)

/** @brief  Enable or disable the AHB6 non-secure peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral.
  */
#if defined(RCC_MP_NS_AHB6ENSETR_MDMAEN)
#define __HAL_RCC_MDMA_CLK_ENABLE()       (RCC->MP_NS_AHB6ENSETR = RCC_MP_NS_AHB6ENSETR_MDMAEN)
#endif /* RCC_MP_NS_AHB6ENSETR_MDMAEN */
#if defined(RCC_MP_NS_AHB6ENCLRR_MDMAEN)
#define __HAL_RCC_MDMA_CLK_DISABLE()      (RCC->MP_NS_AHB6ENCLRR = RCC_MP_NS_AHB6ENCLRR_MDMAEN)
#endif /* RCC_MP_NS_AHB6ENCLRR_MDMAEN */

