zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @brief  Enable or disable the AHB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral to the MPU.
  */
#define __HAL_RCC_DMA1_CLK_ENABLE()       (RCC->MP_AHB2ENSETR = RCC_MP_AHB2ENSETR_DMA1EN)
#define __HAL_RCC_DMA2_CLK_ENABLE()       (RCC->MP_AHB2ENSETR = RCC_MP_AHB2ENSETR_DMA2EN)
#if defined(RCC_MP_AHB2ENSETR_DMAMUX1EN)
#define __HAL_RCC_DMAMUX1_CLK_ENABLE()    (RCC->MP_AHB2ENSETR = RCC_MP_AHB2ENSETR_DMAMUX1EN)
#endif /* RCC_MP_AHB2ENSETR_DMAMUX1EN */
#if defined(RCC_MP_AHB2ENSETR_DMA3EN)
#define __HAL_RCC_DMA3_CLK_ENABLE()       (RCC->MP_AHB2ENSETR = RCC_MP_AHB2ENSETR_DMA3EN)
#endif /* RCC_MP_AHB2ENSETR_DMA3EN */
#if defined(RCC_MP_AHB2ENSETR_DMAMUX2EN)
#define __HAL_RCC_DMAMUX2_CLK_ENABLE()    (RCC->MP_AHB2ENSETR = RCC_MP_AHB2ENSETR_DMAMUX2EN)
#endif /* RCC_MP_AHB2ENSETR_DMAMUX2EN */
#if defined(RCC_MP_AHB2ENSETR_ADC1EN)
#define __HAL_RCC_ADC1_CLK_ENABLE()       (RCC->MP_AHB2ENSETR = RCC_MP_AHB2ENSETR_ADC1EN)
#endif /* RCC_MP_AHB2ENSETR_ADC1EN */
#if defined(RCC_MP_AHB2ENSETR_ADC2EN)
#define __HAL_RCC_ADC2_CLK_ENABLE()       (RCC->MP_AHB2ENSETR = RCC_MP_AHB2ENSETR_ADC2EN)
#endif /* RCC_MP_AHB2ENSETR_ADC2EN */
#define __HAL_RCC_USBO_CLK_ENABLE()       (RCC->MP_AHB2ENSETR = RCC_MP_AHB2ENSETR_USBOEN)

#define __HAL_RCC_DMA1_CLK_DISABLE()      (RCC->MP_AHB2ENCLRR = RCC_MP_AHB2ENCLRR_DMA1EN)
#define __HAL_RCC_DMA2_CLK_DISABLE()      (RCC->MP_AHB2ENCLRR = RCC_MP_AHB2ENCLRR_DMA2EN)
#if defined(RCC_MP_AHB2ENCLRR_DMAMUX1EN)
#define __HAL_RCC_DMAMUX1_CLK_DISABLE()   (RCC->MP_AHB2ENCLRR = RCC_MP_AHB2ENCLRR_DMAMUX1EN)
#endif /* RCC_MP_AHB2ENCLRR_DMAMUX1EN */
#if defined(RCC_MP_AHB2ENCLRR_DMA3EN)
#define __HAL_RCC_DMA3_CLK_DISABLE()      (RCC->MP_AHB2ENCLRR = RCC_MP_AHB2ENCLRR_DMA3EN)
#endif /* RCC_MP_AHB2ENCLRR_DMA3EN */
#if defined(RCC_MP_AHB2ENCLRR_DMAMUX2EN)
#define __HAL_RCC_DMAMUX2_CLK_DISABLE()   (RCC->MP_AHB2ENCLRR = RCC_MP_AHB2ENCLRR_DMAMUX2EN)
#endif /* RCC_MP_AHB2ENCLRR_DMAMUX2EN */
#if defined(RCC_MP_AHB2ENCLRR_ADC1EN)
#define __HAL_RCC_ADC1_CLK_DISABLE()      (RCC->MP_AHB2ENCLRR = RCC_MP_AHB2ENCLRR_ADC1EN)
#endif /* RCC_MP_AHB2ENCLRR_ADC1EN */
#if defined(RCC_MP_AHB2ENCLRR_ADC2EN)
#define __HAL_RCC_ADC2_CLK_DISABLE()      (RCC->MP_AHB2ENCLRR = RCC_MP_AHB2ENCLRR_ADC2EN)
#endif /* RCC_MP_AHB2ENCLRR_ADC2EN */
#define __HAL_RCC_USBO_CLK_DISABLE()      (RCC->MP_AHB2ENCLRR = RCC_MP_AHB2ENCLRR_USBOEN)


/** @brief  Enable or disable the AHB4 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral to the MPU.
  */
#if defined(RCC_MP_AHB4ENSETR_GPIOAEN)
#define __HAL_RCC_GPIOA_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIOAEN)
#endif /* RCC_MP_AHB4ENSETR_GPIOAEN */
#if defined(RCC_MP_AHB4ENSETR_GPIOBEN)
#define __HAL_RCC_GPIOB_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIOBEN)
#endif /* RCC_MP_AHB4ENSETR_GPIOBEN */
#if defined(RCC_MP_AHB4ENSETR_GPIOCEN)
#define __HAL_RCC_GPIOC_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIOCEN)
#endif /* RCC_MP_AHB4ENSETR_GPIOCEN */
#if defined(RCC_MP_AHB4ENSETR_GPIODEN)
#define __HAL_RCC_GPIOD_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIODEN)
#endif /* RCC_MP_AHB4ENSETR_GPIODEN */
#if defined(RCC_MP_AHB4ENSETR_GPIOEEN)
#define __HAL_RCC_GPIOE_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIOEEN)
#endif /* RCC_MP_AHB4ENSETR_GPIOEEN */
#if defined(RCC_MP_AHB4ENSETR_GPIOFEN)
#define __HAL_RCC_GPIOF_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIOFEN)
#endif /* RCC_MP_AHB4ENSETR_GPIOFEN */
#if defined(RCC_MP_AHB4ENSETR_GPIOGEN)
#define __HAL_RCC_GPIOG_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIOGEN)
#endif /* RCC_MP_AHB4ENSETR_GPIOGEN */
#if defined(RCC_MP_AHB4ENSETR_GPIOHEN)
#define __HAL_RCC_GPIOH_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIOHEN)
#endif /* RCC_MP_AHB4ENSETR_GPIOHEN */
#if defined(RCC_MP_AHB4ENSETR_GPIOIEN)
#define __HAL_RCC_GPIOI_CLK_ENABLE()      (RCC->MP_AHB4ENSETR = RCC_MP_AHB4ENSETR_GPIOIEN)
#endif /* RCC_MP_AHB4ENSETR_GPIOIEN */

#if defined(RCC_MP_AHB4ENCLRR_GPIOAEN)
#define __HAL_RCC_GPIOA_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIOAEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIOAEN */
#if defined(RCC_MP_AHB4ENCLRR_GPIOBEN)
#define __HAL_RCC_GPIOB_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIOBEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIOBEN */
#if defined(RCC_MP_AHB4ENCLRR_GPIOCEN)
#define __HAL_RCC_GPIOC_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIOCEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIOCEN */
#if defined(RCC_MP_AHB4ENCLRR_GPIODEN)
#define __HAL_RCC_GPIOD_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIODEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIODEN */
#if defined(RCC_MP_AHB4ENCLRR_GPIOEEN)
#define __HAL_RCC_GPIOE_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIOEEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIOEEN */
#if defined(RCC_MP_AHB4ENCLRR_GPIOFEN)
#define __HAL_RCC_GPIOF_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIOFEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIOFEN */
#if defined(RCC_MP_AHB4ENCLRR_GPIOGEN)
#define __HAL_RCC_GPIOG_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIOGEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIOGEN */
#if defined(RCC_MP_AHB4ENCLRR_GPIOHEN)
#define __HAL_RCC_GPIOH_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIOHEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIOHEN */
#if defined(RCC_MP_AHB4ENCLRR_GPIOIEN)
#define __HAL_RCC_GPIOI_CLK_DISABLE()     (RCC->MP_AHB4ENCLRR = RCC_MP_AHB4ENCLRR_GPIOIEN)
#endif /* RCC_MP_AHB4ENCLRR_GPIOIEN */


/** @brief  Enable or disable the AHB4 secure peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral.
  * @note   A write access to this register field must be secure. A read access may
  *         be secure or non-secure.
  */
#define __HAL_RCC_S_GPIOA_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIOAEN)
#define __HAL_RCC_S_GPIOB_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIOBEN)
#define __HAL_RCC_S_GPIOC_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIOCEN)
#define __HAL_RCC_S_GPIOD_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIODEN)
#define __HAL_RCC_S_GPIOE_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIOEEN)
#define __HAL_RCC_S_GPIOF_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIOFEN)
#define __HAL_RCC_S_GPIOG_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIOGEN)
#define __HAL_RCC_S_GPIOH_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIOHEN)
#define __HAL_RCC_S_GPIOI_CLK_ENABLE()      (RCC->MP_S_AHB4ENSETR = RCC_MP_S_AHB4ENSETR_GPIOIEN)

#define __HAL_RCC_S_GPIOA_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIOAEN)
#define __HAL_RCC_S_GPIOB_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIOBEN)
#define __HAL_RCC_S_GPIOC_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIOCEN)
#define __HAL_RCC_S_GPIOD_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIODEN)
#define __HAL_RCC_S_GPIOE_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIOEEN)
#define __HAL_RCC_S_GPIOF_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIOFEN)
#define __HAL_RCC_S_GPIOG_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIOGEN)
#define __HAL_RCC_S_GPIOH_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIOHEN)
#define __HAL_RCC_S_GPIOI_CLK_DISABLE()     (RCC->MP_S_AHB4ENCLRR = RCC_MP_S_AHB4ENCLRR_GPIOIEN)

/** @brief  Enable or disable the AHB4 non-secure peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it. It shall be used to allocate a peripheral.
  */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIOAEN)
#define __HAL_RCC_GPIOA_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIOAEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIOAEN */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIOBEN)
#define __HAL_RCC_GPIOB_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIOBEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIOBEN */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIOCEN)
#define __HAL_RCC_GPIOC_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIOCEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIOCEN */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIODEN)
#define __HAL_RCC_GPIOD_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIODEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIODEN */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIOEEN)
#define __HAL_RCC_GPIOE_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIOEEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIOEEN */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIOFEN)
#define __HAL_RCC_GPIOF_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIOFEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIOFEN */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIOGEN)
#define __HAL_RCC_GPIOG_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIOGEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIOGEN */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIOHEN)
#define __HAL_RCC_GPIOH_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIOHEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIOHEN */
#if defined(RCC_MP_NS_AHB4ENSETR_GPIOIEN)
#define __HAL_RCC_GPIOI_CLK_ENABLE()      (RCC->MP_NS_AHB4ENSETR = RCC_MP_NS_AHB4ENSETR_GPIOIEN)
#endif /* RCC_MP_NS_AHB4ENSETR_GPIOIEN */

#if defined(RCC_MP_NS_AHB4ENCLRR_GPIOAEN)
#define __HAL_RCC_GPIOA_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIOAEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIOAEN */
#if defined(RCC_MP_NS_AHB4ENCLRR_GPIOBEN)
#define __HAL_RCC_GPIOB_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIOBEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIOBEN */
#if defined(RCC_MP_NS_AHB4ENCLRR_GPIOCEN)
#define __HAL_RCC_GPIOC_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIOCEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIOCEN */
#if defined(RCC_MP_NS_AHB4ENCLRR_GPIODEN)
#define __HAL_RCC_GPIOD_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIODEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIODEN */
#if defined(RCC_MP_NS_AHB4ENCLRR_GPIOEEN)
#define __HAL_RCC_GPIOE_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIOEEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIOEEN */
#if defined(RCC_MP_NS_AHB4ENCLRR_GPIOFEN)
#define __HAL_RCC_GPIOF_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIOFEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIOFEN */
#if defined(RCC_MP_NS_AHB4ENCLRR_GPIOGEN)
#define __HAL_RCC_GPIOG_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIOGEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIOGEN */
#if defined(RCC_MP_NS_AHB4ENCLRR_GPIOHEN)
#define __HAL_RCC_GPIOH_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIOHEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIOHEN */
#if defined(RCC_MP_NS_AHB4ENCLRR_GPIOIEN)
#define __HAL_RCC_GPIOI_CLK_DISABLE()     (RCC->MP_NS_AHB4ENCLRR = RCC_MP_NS_AHB4ENCLRR_GPIOIEN)
#endif /* RCC_MP_NS_AHB4ENCLRR_GPIOIEN */

/** @brief  System reset
  * @note   It generates a system reset
  *         MPSYSRST bit is set by software, cleared by hardware.
  */
#define __HAL_RCC_SYS_RESET()       (RCC->MP_GRSTCSETR = RCC_MP_GRSTCSETR_MPSYSRST)


/** @brief  Enable or disable the APB1 peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#define __HAL_RCC_TIM2_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_TIM2LPEN)
#define __HAL_RCC_TIM3_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_TIM3LPEN)
#define __HAL_RCC_TIM4_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_TIM4LPEN)
#define __HAL_RCC_TIM5_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_TIM5LPEN)
#define __HAL_RCC_TIM6_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_TIM6LPEN)
#define __HAL_RCC_TIM7_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_TIM7LPEN)
#define __HAL_RCC_LPTIM1_CLK_SLEEP_ENABLE()       (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_LPTIM1LPEN)
#define __HAL_RCC_SPI2_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_SPI2LPEN)
#define __HAL_RCC_SPI3_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_SPI3LPEN)
#define __HAL_RCC_USART3_CLK_SLEEP_ENABLE()       (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_USART3LPEN)
#define __HAL_RCC_UART4_CLK_SLEEP_ENABLE()        (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_UART4LPEN)
#define __HAL_RCC_UART5_CLK_SLEEP_ENABLE()        (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_UART5LPEN)
#define __HAL_RCC_UART7_CLK_SLEEP_ENABLE()        (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_UART7LPEN)
#define __HAL_RCC_UART8_CLK_SLEEP_ENABLE()        (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_UART8LPEN)
#define __HAL_RCC_I2C1_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_I2C1LPEN)
#define __HAL_RCC_I2C2_CLK_SLEEP_ENABLE()         (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_I2C2LPEN)
#define __HAL_RCC_SPDIFRX_CLK_SLEEP_ENABLE()      (RCC->MP_APB1LPENSETR = RCC_MP_APB1LPENSETR_SPDIFLPEN)

#define __HAL_RCC_TIM2_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_TIM2LPEN)
#define __HAL_RCC_TIM3_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_TIM3LPEN)
#define __HAL_RCC_TIM4_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_TIM4LPEN)
#define __HAL_RCC_TIM5_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_TIM5LPEN)
#define __HAL_RCC_TIM6_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_TIM6LPEN)
#define __HAL_RCC_TIM7_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_TIM7LPEN)
#define __HAL_RCC_LPTIM1_CLK_SLEEP_DISABLE()      (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_LPTIM1LPEN)
#define __HAL_RCC_SPI2_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_SPI2LPEN)
#define __HAL_RCC_SPI3_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_SPI3LPEN)
#define __HAL_RCC_USART3_CLK_SLEEP_DISABLE()      (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_USART3LPEN)
#define __HAL_RCC_UART4_CLK_SLEEP_DISABLE()       (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_UART4LPEN)
#define __HAL_RCC_UART5_CLK_SLEEP_DISABLE()       (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_UART5LPEN)
#define __HAL_RCC_UART7_CLK_SLEEP_DISABLE()       (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_UART7LPEN)
#define __HAL_RCC_UART8_CLK_SLEEP_DISABLE()       (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_UART8LPEN)
#define __HAL_RCC_I2C1_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_I2C1LPEN)
#define __HAL_RCC_I2C2_CLK_SLEEP_DISABLE()        (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_I2C2LPEN)
#define __HAL_RCC_SPDIFRX_CLK_SLEEP_DISABLE()     (RCC->MP_APB1LPENCLRR = RCC_MP_APB1LPENCLRR_SPDIFLPEN)


