zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
#if defined(DCMIPP)
#define __HAL_RCC_DCMIPP_CLK_SLEEP_DISABLE()      (RCC->MP_APB4LPENCLRR = RCC_MP_APB4LPENCLRR_DCMIPPLPEN)
#endif /* DCMIPP */
#define __HAL_RCC_DDRPERFM_CLK_SLEEP_DISABLE()    (RCC->MP_APB4LPENCLRR = RCC_MP_APB4LPENCLRR_DDRPERFMLPEN)
#define __HAL_RCC_IWDG2APB_CLK_SLEEP_DISABLE()    (RCC->MP_APB4LPENCLRR = RCC_MP_APB4LPENCLRR_IWDG2APBLPEN)
#define __HAL_RCC_USBPHY_CLK_SLEEP_DISABLE()      (RCC->MP_APB4LPENCLRR = RCC_MP_APB4LPENCLRR_USBPHYLPEN)
#define __HAL_RCC_STGENRO_CLK_SLEEP_DISABLE()     (RCC->MP_APB4LPENCLRR = RCC_MP_APB4LPENCLRR_STGENROLPEN)
#define __HAL_RCC_STGENRO_CLK_STOP_DISABLE()      (RCC->MP_APB4LPENCLRR = RCC_MP_APB4LPENCLRR_STGENROSTPEN)

/** @brief  Enable or disable the APB4 secure peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  * @note   A write access to this register field must be secure. A read access
  *         may be secure or non-secure.
  */
#define __HAL_RCC_S_LTDC_CLK_SLEEP_ENABLE()       (RCC->MP_S_APB4LPENSETR = RCC_MP_S_APB4LPENSETR_LTDCLPEN)
#define __HAL_RCC_S_LTDC_CLK_SLEEP_DISABLE()      (RCC->MP_S_APB4LPENCLRR = RCC_MP_S_APB4LPENCLRR_LTDCLPEN)


/** @brief  Enable or disable the APB4 non-secure peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#if defined(RCC_MP_NS_APB4LPENSETR_LTDCLPEN)
#define __HAL_RCC_LTDC_CLK_SLEEP_ENABLE()         (RCC->MP_NS_APB4LPENSETR = RCC_MP_NS_APB4LPENSETR_LTDCLPEN)
#endif /* RCC_MP_NS_APB4LPENSETR_LTDCLPEN */
#if defined(RCC_MP_NS_APB4LPENCLRR_LTDCLPEN)
#define __HAL_RCC_LTDC_CLK_SLEEP_DISABLE()        (RCC->MP_NS_APB4LPENCLRR = RCC_MP_NS_APB4LPENCLRR_LTDCLPEN)
#endif /* RCC_MP_NS_APB4LPENCLRR_LTDCLPEN */

/** @brief  Enable or disable the APB5 peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#define __HAL_RCC_RTCAPB_CLK_SLEEP_ENABLE()       (RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_RTCAPBLPEN)
#if defined(RCC_MP_APB5LPENSETR_TZCLPEN)
#define __HAL_RCC_TZC_CLK_SLEEP_ENABLE()         (RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_TZCLPEN)
#endif /* RCC_MP_APB5LPENSETR_TZCLPEN */
#if defined(RCC_MP_APB5LPENSETR_ETZPCLPEN)
#define __HAL_RCC_ETZPC_CLK_SLEEP_ENABLE()         (RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_ETZPCLPEN)
#endif /* RCC_MP_APB5LPENSETR_ETZPCLPEN */
#define __HAL_RCC_IWDG1APB_CLK_SLEEP_ENABLE()     (RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_IWDG1APBLPEN)
#define __HAL_RCC_BSEC_CLK_SLEEP_ENABLE()         (RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_BSECLPEN)
#if defined(RCC_MP_APB5LPENSETR_STGENCLPEN)
#define __HAL_RCC_STGEN_CLK_SLEEP_ENABLE()        (RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_STGENCLPEN)
#endif /* RCC_MP_APB5LPENSETR_STGENCLPEN */
#if defined(RCC_MP_APB5LPENSETR_STGENCSTPEN)
#define __HAL_RCC_STGENCSTP_CLK_SLEEP_ENABLE()    (RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_STGENCSTPPEN)
#endif /* RCC_MP_APB5LPENSETR_STGENCSTPEN */

#define __HAL_RCC_RTCAPB_CLK_SLEEP_DISABLE()      (RCC->MP_APB5LPENCLRR = RCC_MP_APB5LPENCLRR_RTCAPBLPEN)
#if defined(RCC_MP_APB5LPENSETR_TZCLPEN)
#define __HAL_RCC_TZC_CLK_SLEEP_DISABLE()         (RCC->MP_APB5LPENCLRR = RCC_MP_APB5LPENCLRR_TZCLPEN)
#endif /* RCC_MP_APB5LPENSETR_TZCLPEN */
#if defined(RCC_MP_APB5LPENCLRR_ETZPCLPEN)
#define __HAL_RCC_ETZPC_CLK_SLEEP_DISABLE()       (RCC->MP_APB5LPENCLRR = RCC_MP_APB5LPENCLRR_ETZPCLPEN)
#endif /* RCC_MP_APB5LPENCLRR_ETZPCLPEN */
#define __HAL_RCC_IWDG1APB_CLK_SLEEP_DISABLE()    (RCC->MP_APB5LPENCLRR = RCC_MP_APB5LPENCLRR_IWDG1APBLPEN)
#define __HAL_RCC_BSEC_CLK_SLEEP_DISABLE()        (RCC->MP_APB5LPENCLRR = RCC_MP_APB5LPENCLRR_BSECLPEN)
#if defined(RCC_MP_APB5LPENCLRR_STGENLPEN)
#define __HAL_RCC_STGEN_CLK_SLEEP_DISABLE()       (RCC->MP_APB5LPENCLRR = RCC_MP_APB5LPENCLRR_STGENLPEN)
#endif /* RCC_MP_APB5LPENCLRR_STGENLPEN */
#if defined(RCC_MP_APB5LPENSETR_STGENCLPEN)
#define __HAL_RCC_STGEN_CLK_SLEEP_DISABLE()       (RCC->MP_APB5LPENCLRR = RCC_MP_APB5LPENCLRR_STGENCLPEN)
#endif /* RCC_MP_APB5LPENSETR_STGENCLPEN */

/** @brief  Enable or disable the APB6 peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#if defined(RCC_MP_APB6LPENSETR_TIM17LPEN)
#define __HAL_RCC_TIM17_SLEEP_ENABLE()            (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_TIM17LPEN)
#endif /* RCC_MP_APB6LPENSETR_TIM17LPEN */
#if defined(RCC_MP_APB6LPENSETR_TIM16LPEN)
#define __HAL_RCC_TIM16_SLEEP_ENABLE()            (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_TIM16LPEN)
#endif /* RCC_MP_APB6LPENSETR_TIM16LPEN */
#if defined(RCC_MP_APB6LPENSETR_TIM15LPEN)
#define __HAL_RCC_TIM15_SLEEP_ENABLE()            (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_TIM15LPEN)
#endif /* RCC_MP_APB6LPENSETR_TIM15LPEN */
#if defined(RCC_MP_APB6LPENSETR_TIM14LPEN)
#define __HAL_RCC_TIM14_SLEEP_ENABLE()            (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_TIM14LPEN)
#endif /* RCC_MP_APB6LPENSETR_TIM14LPEN */
#if defined(RCC_MP_APB6LPENSETR_TIM13LPEN)
#define __HAL_RCC_TIM13_SLEEP_ENABLE()            (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_TIM13LPEN)
#endif /* RCC_MP_APB6LPENSETR_TIM13LPEN */
#if defined(RCC_MP_APB6LPENSETR_TIM12LPEN)
#define __HAL_RCC_TIM12_SLEEP_ENABLE()            (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_TIM12LPEN)
#endif /* RCC_MP_APB6LPENSETR_TIM12LPEN */
#if defined(RCC_MP_APB6LPENSETR_I2C5LPEN)
#define __HAL_RCC_I2C5_SLEEP_ENABLE()             (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_I2C5LPEN)
#endif /* RCC_MP_APB6LPENSETR_I2C5LPEN */
#if defined(RCC_MP_APB6LPENSETR_I2C4LPEN)
#define __HAL_RCC_I2C4_SLEEP_ENABLE()             (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_I2C4LPEN)
#endif /* RCC_MP_APB6LPENSETR_I2C4LPEN */
#if defined(RCC_MP_APB6LPENSETR_I2C3LPEN)
#define __HAL_RCC_I2C3_SLEEP_ENABLE()             (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_I2C3LPEN)
#endif /* RCC_MP_APB6LPENSETR_I2C3LPEN */
#if defined(RCC_MP_APB6LPENSETR_SPI5LPEN)
#define __HAL_RCC_SPI5_SLEEP_ENABLE()             (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_SPI5LPEN)
#endif /* RCC_MP_APB6LPENSETR_SPI5LPEN */
#if defined(RCC_MP_APB6LPENSETR_SPI4LPEN)
#define __HAL_RCC_SPI4_SLEEP_ENABLE()             (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_SPI4LPEN)
#endif /* RCC_MP_APB6LPENSETR_SPI4LPEN */
#if defined(RCC_MP_APB6LPENSETR_USART2LPEN)
#define __HAL_RCC_USART2_SLEEP_ENABLE()           (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_USART2LPEN)
#endif /* RCC_MP_APB6LPENSETR_USART2LPEN */
#if defined(RCC_MP_APB6LPENSETR_USART1LPEN)
#define __HAL_RCC_USART1_SLEEP_ENABLE()           (RCC->MP_APB6LPENSETR = RCC_MP_APB6LPENSETR_USART1LPEN)
#endif /* RCC_MP_APB6LPENSETR_USART1LPEN */

