zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
#if defined(RCC_MP_APB6LPENCLRR_TIM17LPEN)
#define __HAL_RCC_TIM17_SLEEP_DISABLE()           (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_TIM17LPEN)
#endif /* RCC_MP_APB6LPENCLRR_TIM17LPEN */
#if defined(RCC_MP_APB6LPENCLRR_TIM16LPEN)
#define __HAL_RCC_TIM16_SLEEP_DISABLE()           (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_TIM16LPEN)
#endif /* RCC_MP_APB6LPENCLRR_TIM16LPEN */
#if defined(RCC_MP_APB6LPENCLRR_TIM15LPEN)
#define __HAL_RCC_TIM15_SLEEP_DISABLE()           (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_TIM15LPEN)
#endif /* RCC_MP_APB6LPENCLRR_TIM15LPEN */
#if defined(RCC_MP_APB6LPENCLRR_TIM14LPEN)
#define __HAL_RCC_TIM14_SLEEP_DISABLE()           (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_TIM14LPEN)
#endif /* RCC_MP_APB6LPENCLRR_TIM14LPEN */
#if defined(RCC_MP_APB6LPENCLRR_TIM13LPEN)
#define __HAL_RCC_TIM13_SLEEP_DISABLE()           (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_TIM13LPEN)
#endif /* RCC_MP_APB6LPENCLRR_TIM13LPEN */
#if defined(RCC_MP_APB6LPENCLRR_TIM12LPEN)
#define __HAL_RCC_TIM12_SLEEP_DISABLE()           (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_TIM12LPEN)
#endif /* RCC_MP_APB6LPENCLRR_TIM12LPEN */
#if defined(RCC_MP_APB6LPENCLRR_I2C5LPEN)
#define __HAL_RCC_I2C5_SLEEP_DISABLE()            (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_I2C5LPEN)
#endif /* RCC_MP_APB6LPENCLRR_I2C5LPEN */
#if defined(RCC_MP_APB6LPENCLRR_I2C4LPEN)
#define __HAL_RCC_I2C4_SLEEP_DISABLE()            (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_I2C4LPEN)
#endif /* RCC_MP_APB6LPENCLRR_I2C4LPEN */
#if defined(RCC_MP_APB6LPENCLRR_I2C3LPEN)
#define __HAL_RCC_I2C3_SLEEP_DISABLE()            (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_I2C3LPEN)
#endif /* RCC_MP_APB6LPENCLRR_I2C3LPEN */
#if defined(RCC_MP_APB6LPENCLRR_SPI5LPEN)
#define __HAL_RCC_SPI5_SLEEP_DISABLE()            (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_SPI5LPEN)
#endif /* RCC_MP_APB6LPENCLRR_SPI5LPEN */
#if defined(RCC_MP_APB6LPENCLRR_SPI4LPEN)
#define __HAL_RCC_SPI4_SLEEP_DISABLE()            (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_SPI4LPEN)
#endif /* RCC_MP_APB6LPENCLRR_SPI4LPEN */
#if defined(RCC_MP_APB6LPENCLRR_USART2LPEN)
#define __HAL_RCC_USART2_SLEEP_DISABLE()          (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_USART2LPEN)
#endif /* RCC_MP_APB6LPENCLRR_USART2LPEN */
#if defined(RCC_MP_APB6LPENCLRR_USART1LPEN)
#define __HAL_RCC_USART1_SLEEP_DISABLE()          (RCC->MP_APB6LPENCLRR = RCC_MP_APB6LPENCLRR_USART1LPEN)
#endif /* RCC_MP_APB6LPENCLRR_USART1LPEN */

/** @brief  Enable or disable the AHB5 peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#if defined(PKA)
#define __HAL_RCC_PKA_CLK_SLEEP_ENABLE()          (RCC->MP_AHB5LPENSETR = RCC_MP_AHB5LPENSETR_PKALPEN)
#endif /* PKA */
#if defined(SAES)
#define __HAL_RCC_SAES_CLK_SLEEP_ENABLE()         (RCC->MP_AHB5LPENSETR = RCC_MP_AHB5LPENSETR_SAESLPEN)
#endif /* SAES */
#if defined(CRYP1)
#define __HAL_RCC_CRYP1_CLK_SLEEP_ENABLE()        (RCC->MP_AHB5LPENSETR = RCC_MP_AHB5LPENSETR_CRYP1LPEN)
#endif /* CRYP1 */
#define __HAL_RCC_HASH1_CLK_SLEEP_ENABLE()        (RCC->MP_AHB5LPENSETR = RCC_MP_AHB5LPENSETR_HASH1LPEN)
#define __HAL_RCC_RNG1_CLK_SLEEP_ENABLE()         (RCC->MP_AHB5LPENSETR = RCC_MP_AHB5LPENSETR_RNG1LPEN)
#define __HAL_RCC_BKPSRAM_CLK_SLEEP_ENABLE()      (RCC->MP_AHB5LPENSETR = RCC_MP_AHB5LPENSETR_BKPSRAMLPEN)

#if defined(PKA)
#define __HAL_RCC_PKA_CLK_SLEEP_DISABLE()         (RCC->MP_AHB5LPENCLRR = RCC_MP_AHB5LPENCLRR_PKALPEN)
#endif /* PKA */
#if defined(SAES)
#define __HAL_RCC_SAES_CLK_SLEEP_DISABLE()        (RCC->MP_AHB5LPENCLRR = RCC_MP_AHB5LPENCLRR_SAESLPEN)
#endif /* SAES */
#if defined(CRYP1)
#define __HAL_RCC_CRYP1_CLK_SLEEP_DISABLE()       (RCC->MP_AHB5LPENCLRR = RCC_MP_AHB5LPENCLRR_CRYP1LPEN)
#endif /* CRYP1 */
#define __HAL_RCC_HASH1_CLK_SLEEP_DISABLE()       (RCC->MP_AHB5LPENCLRR = RCC_MP_AHB5LPENCLRR_HASH1LPEN)
#define __HAL_RCC_RNG1_CLK_SLEEP_DISABLE()        (RCC->MP_AHB5LPENCLRR = RCC_MP_AHB5LPENCLRR_RNG1LPEN)
#define __HAL_RCC_BKPSRAM_CLK_SLEEP_DISABLE()     (RCC->MP_AHB5LPENCLRR = RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN)


/** @brief  Enable or disable the AHB6 peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#if defined(RCC_MP_AHB6LPENSETR_MCELPEN)
#define __HAL_RCC_MCE_CLK_SLEEP_ENABLE()          (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_MCELPEN)
#endif /* RCC_MP_AHB6LPENSETR_MCELPEN */
#if defined(RCC_MP_AHB6LPENSETR_ETH1CKLPEN)
#define __HAL_RCC_ETH1CK_CLK_SLEEP_ENABLE()       (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_ETH1CKLPEN)
#endif /* RCC_MP_AHB6LPENSETR_ETH1CKLPEN */
#if defined(RCC_MP_AHB6LPENSETR_ETH2CKLPEN)
#define __HAL_RCC_ETH2CK_CLK_SLEEP_ENABLE()       (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_ETH2CKLPEN)
#endif /* RCC_MP_AHB6LPENSETR_ETH2CKLPEN */
#if defined(RCC_MP_AHB6LPENSETR_ETH1TXLPEN)
#define __HAL_RCC_ETH1TX_CLK_SLEEP_ENABLE()       (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_ETH1TXLPEN)
#endif /* RCC_MP_AHB6LPENSETR_ETH1TXLPEN */
#if defined(RCC_MP_AHB6LPENSETR_ETH2TXLPEN)
#define __HAL_RCC_ETH2TX_CLK_SLEEP_ENABLE()       (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_ETH2TXLPEN)
#endif /* RCC_MP_AHB6LPENSETR_ETH2TXLPEN */
#if defined(RCC_MP_AHB6LPENSETR_ETH1RXLPEN)
#define __HAL_RCC_ETH1RX_CLK_SLEEP_ENABLE()       (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_ETH1RXLPEN)
#endif /* RCC_MP_AHB6LPENSETR_ETH1RXLPEN */
#if defined(RCC_MP_AHB6LPENSETR_ETH2RXLPEN)
#define __HAL_RCC_ETH2RX_CLK_SLEEP_ENABLE()       (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_ETH2RXLPEN)
#endif /* RCC_MP_AHB6LPENSETR_ETH2RXLPEN */
#if defined(RCC_MP_AHB6LPENSETR_ETH1MACLPEN)
#define __HAL_RCC_ETH1MAC_CLK_SLEEP_ENABLE()      (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_ETH1MACLPEN)
#endif /* RCC_MP_AHB6LPENSETR_ETH1MACLPEN */
#if defined(RCC_MP_AHB6LPENSETR_ETH2MACLPEN)
#define __HAL_RCC_ETH2MAC_CLK_SLEEP_ENABLE()      (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_ETH2MACLPEN)
#endif /* RCC_MP_AHB6LPENSETR_ETH2MACLPEN */
#define __HAL_RCC_FMC_CLK_SLEEP_ENABLE()          (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_FMCLPEN)
#define __HAL_RCC_QSPI_CLK_SLEEP_ENABLE()         (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_QSPILPEN)
#define __HAL_RCC_SDMMC1_CLK_SLEEP_ENABLE()       (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_SDMMC1LPEN)
#define __HAL_RCC_SDMMC2_CLK_SLEEP_ENABLE()       (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_SDMMC2LPEN)
#define __HAL_RCC_CRC1_CLK_SLEEP_ENABLE()         (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_CRC1LPEN)
#define __HAL_RCC_USBH_CLK_SLEEP_ENABLE()         (RCC->MP_AHB6LPENSETR = RCC_MP_AHB6LPENSETR_USBHLPEN)

#if defined(RCC_MP_AHB6LPENCLRR_MCELPEN)
#define __HAL_RCC_MCE_CLK_SLEEP_DISABLE()         (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_MCELPEN)
#endif /* RCC_MP_AHB6LPENCLRR_MCELPEN */
#if defined(RCC_MP_AHB6LPENCLRR_ETH1CKLPEN)
#define __HAL_RCC_ETH1CK_CLK_SLEEP_DISABLE()      (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_ETH1CKLPEN)
#endif /* RCC_MP_AHB6LPENCLRR_ETH1CKLPEN */
#if defined(RCC_MP_AHB6LPENCLRR_ETH2CKLPEN)
#define __HAL_RCC_ETH2CK_CLK_SLEEP_DISABLE()      (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_ETH2CKLPEN)
#endif /* RCC_MP_AHB6LPENCLRR_ETH2CKLPEN */
#if defined(RCC_MP_AHB6LPENCLRR_ETH1TXLPEN)
#define __HAL_RCC_ETH1TX_CLK_SLEEP_DISABLE()      (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_ETH1TXLPEN)
#endif /* RCC_MP_AHB6LPENCLRR_ETH1TXLPEN */
#if defined(RCC_MP_AHB6LPENCLRR_ETH2TXLPEN)
#define __HAL_RCC_ETH2TX_CLK_SLEEP_DISABLE()      (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_ETH2TXLPEN)
#endif /* RCC_MP_AHB6LPENCLRR_ETH2TXLPEN */
#if defined(RCC_MP_AHB6LPENCLRR_ETH1RXLPEN)
#define __HAL_RCC_ETH1RX_CLK_SLEEP_DISABLE()      (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_ETH1RXLPEN)
#endif /* RCC_MP_AHB6LPENCLRR_ETH1RXLPEN */
#if defined(RCC_MP_AHB6LPENCLRR_ETH2RXLPEN)
#define __HAL_RCC_ETH2RX_CLK_SLEEP_DISABLE()      (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_ETH2RXLPEN)
#endif /* RCC_MP_AHB6LPENCLRR_ETH2RXLPEN */
#if defined(RCC_MP_AHB6LPENCLRR_ETH1MACLPEN)
#define __HAL_RCC_ETH1MAC_CLK_SLEEP_DISABLE()     (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_ETH1MACLPEN)
#endif /* RCC_MP_AHB6LPENCLRR_ETH1MACLPEN */
#if defined(RCC_MP_AHB6LPENCLRR_ETH2MACLPEN)
#define __HAL_RCC_ETH2MAC_CLK_SLEEP_DISABLE()     (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_ETH2MACLPEN)
#endif /* RCC_MP_AHB6LPENCLRR_ETH2MACLPEN */
#define __HAL_RCC_FMC_CLK_SLEEP_DISABLE()         (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_FMCLPEN)
#define __HAL_RCC_QSPI_CLK_SLEEP_DISABLE()        (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_QSPILPEN)
#define __HAL_RCC_SDMMC1_CLK_SLEEP_DISABLE()      (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_SDMMC1LPEN)
#define __HAL_RCC_SDMMC2_CLK_SLEEP_DISABLE()      (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_SDMMC2LPEN)
#define __HAL_RCC_CRC1_CLK_SLEEP_DISABLE()        (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_CRC1LPEN)
#define __HAL_RCC_USBH_CLK_SLEEP_DISABLE()        (RCC->MP_AHB6LPENCLRR = RCC_MP_AHB6LPENCLRR_USBHLPEN)

/** @brief  Enable or disable the AHB6 secure peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  * @note   A write access to this register field must be secure. A read access
  *         may be secure or non-secure.
  */
#define __HAL_RCC_S_MDMA_CLK_SLEEP_ENABLE()       (RCC->MP_S_AHB6LPENSETR = RCC_MP_S_AHB6LPENSETR_MDMALPEN)
#define __HAL_RCC_S_MDMA_CLK_SLEEP_DISABLE()      (RCC->MP_S_AHB6LPENCLRR = RCC_MP_S_AHB6LPENCLRR_MDMALPEN)

/** @brief  Enable or disable the AHB6 non-secure peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#if defined(RCC_MP_NS_AHB6LPENSETR_MDMALPEN)
#define __HAL_RCC_MDMA_CLK_SLEEP_ENABLE()         (RCC->MP_NS_AHB6LPENSETR = RCC_MP_NS_AHB6LPENSETR_MDMALPEN)
#endif /* RCC_MP_NS_AHB6LPENSETR_MDMALPEN */
#if defined(RCC_MP_NS_AHB6LPENCLRR_MDMALPEN)
#define __HAL_RCC_MDMA_CLK_SLEEP_DISABLE()        (RCC->MP_NS_AHB6LPENCLRR = RCC_MP_NS_AHB6LPENCLRR_MDMALPEN)
#endif /* RCC_MP_NS_AHB6LPENCLRR_MDMALPEN */

