zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @brief  Enable or disable the AHB2 peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#define __HAL_RCC_DMA1_CLK_SLEEP_ENABLE()         (RCC->MP_AHB2LPENSETR = RCC_MP_AHB2LPENSETR_DMA1LPEN)
#define __HAL_RCC_DMA2_CLK_SLEEP_ENABLE()         (RCC->MP_AHB2LPENSETR = RCC_MP_AHB2LPENSETR_DMA2LPEN)
#if defined(RCC_MP_AHB2LPENSETR_DMAMUX1LPEN)
#define __HAL_RCC_DMAMUX1_CLK_SLEEP_ENABLE()      (RCC->MP_AHB2LPENSETR = RCC_MP_AHB2LPENSETR_DMAMUX1LPEN)
#endif /* RCC_MP_AHB2LPENSETR_DMAMUX1LPEN */
#if defined(RCC_MP_AHB2LPENSETR_DMA3LPEN)
#define __HAL_RCC_DMA3_CLK_SLEEP_ENABLE()         (RCC->MP_AHB2LPENSETR = RCC_MP_AHB2LPENSETR_DMA3LPEN)
#endif /* RCC_MP_AHB2LPENSETR_DMA3LPEN */
#if defined(RCC_MP_AHB2LPENSETR_DMAMUX2LPEN)
#define __HAL_RCC_DMAMUX2_CLK_SLEEP_ENABLE()      (RCC->MP_AHB2LPENSETR = RCC_MP_AHB2LPENSETR_DMAMUX2LPEN)
#endif /* RCC_MP_AHB2LPENSETR_DMAMUX2LPEN */
#if defined(RCC_MP_AHB2LPENSETR_ADC1LPEN)
#define __HAL_RCC_ADC1_CLK_SLEEP_ENABLE()         (RCC->MP_AHB2LPENSETR = RCC_MP_AHB2LPENSETR_ADC1LPEN)
#endif /* RCC_MP_AHB2LPENSETR_ADC1LPEN */
#if defined(RCC_MP_AHB2LPENSETR_ADC2LPEN)
#define __HAL_RCC_ADC2_CLK_SLEEP_ENABLE()         (RCC->MP_AHB2LPENSETR = RCC_MP_AHB2LPENSETR_ADC2LPEN)
#endif /* RCC_MP_AHB2LPENSETR_ADC2LPEN */
#define __HAL_RCC_USBO_CLK_SLEEP_ENABLE()         (RCC->MP_AHB2LPENSETR = RCC_MP_AHB2LPENSETR_USBOLPEN)

#define __HAL_RCC_DMA1_CLK_SLEEP_DISABLE()        (RCC->MP_AHB2LPENCLRR = RCC_MP_AHB2LPENCLRR_DMA1LPEN)
#define __HAL_RCC_DMA2_CLK_SLEEP_DISABLE()        (RCC->MP_AHB2LPENCLRR = RCC_MP_AHB2LPENCLRR_DMA2LPEN)
#if defined(RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN)
#define __HAL_RCC_DMAMUX1_CLK_SLEEP_DISABLE()     (RCC->MP_AHB2LPENCLRR = RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN)
#endif /* RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN */
#if defined(RCC_MP_AHB2LPENCLRR_DMA3LPEN)
#define __HAL_RCC_DMA3_CLK_SLEEP_DISABLE()        (RCC->MP_AHB2LPENCLRR = RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN)
#endif /* RCC_MP_AHB2LPENCLRR_DMA3LPEN */
#if defined(RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN)
#define __HAL_RCC_DMAMUX2_CLK_SLEEP_DISABLE()     (RCC->MP_AHB2LPENCLRR = RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN)
#endif /* RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN */
#if defined(RCC_MP_AHB2LPENCLRR_ADC1LPEN)
#define __HAL_RCC_ADC1_CLK_SLEEP_DISABLE()        (RCC->MP_AHB2LPENCLRR = RCC_MP_AHB2LPENCLRR_ADC1LPEN)
#endif /* RCC_MP_AHB2LPENCLRR_ADC1LPEN */
#if defined(RCC_MP_AHB2LPENCLRR_ADC2LPEN)
#define __HAL_RCC_ADC2_CLK_SLEEP_DISABLE()        (RCC->MP_AHB2LPENCLRR = RCC_MP_AHB2LPENCLRR_ADC2LPEN)
#endif /* RCC_MP_AHB2LPENCLRR_ADC2LPEN */
#define __HAL_RCC_USBO_CLK_SLEEP_DISABLE()        (RCC->MP_AHB2LPENCLRR = RCC_MP_AHB2LPENCLRR_USBOLPEN)

/** @brief  Enable or disable the AHB4 peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  */
#if defined(RCC_MP_AHB4LPENSETR_GPIOALPEN)
#define __HAL_RCC_GPIOA_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIOALPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIOALPEN */
#if defined(RCC_MP_AHB4LPENSETR_GPIOBLPEN)
#define __HAL_RCC_GPIOB_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIOBLPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIOBLPEN */
#if defined(RCC_MP_AHB4LPENSETR_GPIOCLPEN)
#define __HAL_RCC_GPIOC_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIOCLPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIOCLPEN */
#if defined(RCC_MP_AHB4LPENSETR_GPIODLPEN)
#define __HAL_RCC_GPIOD_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIODLPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIODLPEN */
#if defined(RCC_MP_AHB4LPENSETR_GPIOELPEN)
#define __HAL_RCC_GPIOE_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIOELPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIOELPEN */
#if defined(RCC_MP_AHB4LPENSETR_GPIOFLPEN)
#define __HAL_RCC_GPIOF_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIOFLPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIOFLPEN */
#if defined(RCC_MP_AHB4LPENSETR_GPIOGLPEN)
#define __HAL_RCC_GPIOG_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIOGLPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIOGLPEN */
#if defined(RCC_MP_AHB4LPENSETR_GPIOHLPEN)
#define __HAL_RCC_GPIOH_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIOHLPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIOHLPEN */
#if defined(RCC_MP_AHB4LPENSETR_GPIOILPEN)
#define __HAL_RCC_GPIOI_CLK_SLEEP_ENABLE()        (RCC->MP_AHB4LPENSETR = RCC_MP_AHB4LPENSETR_GPIOILPEN)
#endif /* RCC_MP_AHB4LPENSETR_GPIOILPEN */

#if defined(RCC_MP_AHB4LPENCLRR_GPIOALPEN)
#define __HAL_RCC_GPIOA_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIOALPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIOALPEN */
#if defined(RCC_MP_AHB4LPENCLRR_GPIOBLPEN)
#define __HAL_RCC_GPIOB_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIOBLPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIOBLPEN */
#if defined(RCC_MP_AHB4LPENCLRR_GPIOCLPEN)
#define __HAL_RCC_GPIOC_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIOCLPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIOCLPEN */
#if defined(RCC_MP_AHB4LPENCLRR_GPIODLPEN)
#define __HAL_RCC_GPIOD_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIODLPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIODLPEN */
#if defined(RCC_MP_AHB4LPENCLRR_GPIOELPEN)
#define __HAL_RCC_GPIOE_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIOELPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIOELPEN */
#if defined(RCC_MP_AHB4LPENCLRR_GPIOFLPEN)
#define __HAL_RCC_GPIOF_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIOFLPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIOFLPEN */
#if defined(RCC_MP_AHB4LPENCLRR_GPIOGLPEN)
#define __HAL_RCC_GPIOG_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIOGLPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIOGLPEN */
#if defined(RCC_MP_AHB4LPENCLRR_GPIOHLPEN)
#define __HAL_RCC_GPIOH_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIOHLPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIOHLPEN */
#if defined(RCC_MP_AHB4LPENCLRR_GPIOILPEN)
#define __HAL_RCC_GPIOI_CLK_SLEEP_DISABLE()       (RCC->MP_AHB4LPENCLRR = RCC_MP_AHB4LPENCLRR_GPIOILPEN)
#endif /* RCC_MP_AHB4LPENCLRR_GPIOILPEN */

/** @brief  Enable or disable the AHB4 secure peripheral clock during  CSLEEP mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during CSLEEP mode.
  * @note   A write access to this register field must be secure. A read access
  *         may be secure or non-secure.
  */
#define __HAL_RCC_S_GPIOA_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIOALPEN)
#define __HAL_RCC_S_GPIOB_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIOBLPEN)
#define __HAL_RCC_S_GPIOC_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIOCLPEN)
#define __HAL_RCC_S_GPIOD_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIODLPEN)
#define __HAL_RCC_S_GPIOE_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIOELPEN)
#define __HAL_RCC_S_GPIOF_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIOFLPEN)
#define __HAL_RCC_S_GPIOG_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIOGLPEN)
#define __HAL_RCC_S_GPIOH_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIOHLPEN)
#define __HAL_RCC_S_GPIOI_CLK_SLEEP_ENABLE()        (RCC->MP_S_AHB4LPENSETR = RCC_MP_S_AHB4LPENSETR_GPIOILPEN)

