zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @brief Macro to test if HSE oscillator is used somewhere in the core system
  *  @note  HAL driver does not ensure these clocks are used by peripherals, it's
  *         up to user code
  */
#define IS_HSE_IN_USE() \
  (( ((__HAL_RCC_GET_MPU_SOURCE()    == RCC_MPUSOURCE_HSE   ) && (__HAL_RCC_GET_FLAG(RCC_FLAG_MPUSRCRDY) == 1U) ) || \
     ((__HAL_RCC_GET_AXIS_SOURCE()   == RCC_AXISSOURCE_HSE  ) && (__HAL_RCC_GET_FLAG(RCC_FLAG_AXISSRCRDY) == 1U)) || \
     ((__HAL_RCC_GET_MLAHB_SOURCE()  == RCC_MLAHBSSOURCE_HSE ) && (__HAL_RCC_GET_FLAG(RCC_FLAG_MLAHBSSRCRDY) == 1U ))||\
     \
     ((__HAL_RCC_GET_PLL12_SOURCE()  == RCC_PLL12SOURCE_HSE)   &&                                            \
      ( (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL1RDY) == 1U) || (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL2RDY) == 1U) )) || \
     \
     ((__HAL_RCC_GET_PLL3_SOURCE()   == RCC_PLL3SOURCE_HSE)    && (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL3RDY) == 1U) )  || \
     \
     ((__HAL_RCC_GET_PLL4_SOURCE()   == RCC_PLL4SOURCE_HSE)    && (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL4RDY) == 1U) )) ? \
   1U : 0U)

/** @brief Macro to test if HSI oscillator is used somewhere in the core system
  *  @note  HAL driver does not ensure these clocks are used by peripherals, it's
  *         up to user code
  */
#define IS_HSI_IN_USE() \
  (( ((__HAL_RCC_GET_MPU_SOURCE()    == RCC_MPUSOURCE_HSI   ) && (__HAL_RCC_GET_FLAG(RCC_FLAG_MPUSRCRDY) == 1U) ) || \
     ((__HAL_RCC_GET_AXIS_SOURCE()   == RCC_AXISSOURCE_HSI  ) && (__HAL_RCC_GET_FLAG(RCC_FLAG_AXISSRCRDY) == 1U)) || \
     ((__HAL_RCC_GET_MLAHB_SOURCE()  == RCC_MLAHBSSOURCE_HSI) && (__HAL_RCC_GET_FLAG(RCC_FLAG_MLAHBSSRCRDY) == 1U)) || \
     \
     ((__HAL_RCC_GET_PLL12_SOURCE()  == RCC_PLL12SOURCE_HSI)   &&                                             \
      ( (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL1RDY) == 1U)   || (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL2RDY) == 1U)))     || \
     \
     ((__HAL_RCC_GET_PLL3_SOURCE()   == RCC_PLL3SOURCE_HSI)    && (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL3RDY) == 1U))   || \
     \
     ((__HAL_RCC_GET_PLL4_SOURCE()   == RCC_PLL4SOURCE_HSI) && (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL4RDY) == 1U))) ? 1U : 0U)

/** @brief Macro to test if CSI oscillator is used somewhere in the core system
  *  @note  HAL driver does not ensure these clocks are used by peripherals, it's
  *         up to user code
  */
#define IS_CSI_IN_USE() \
  (( ((__HAL_RCC_GET_PLL3_SOURCE()   == RCC_PLL3SOURCE_CSI)  && (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL3RDY) == 1U) ) || \
     ((__HAL_RCC_GET_MLAHB_SOURCE()  == RCC_MLAHBSSOURCE_CSI ) && (__HAL_RCC_GET_FLAG(RCC_FLAG_MLAHBSSRCRDY) == 1U))||\
     \
     ((__HAL_RCC_GET_PLL4_SOURCE()   == RCC_PLL4SOURCE_CSI)  && (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL4RDY) == 1U) )) ? \
   1U : 0U)

/** @brief Macros to test if PLLx are used on the Core and buses clock generation system (MPU, MLAHB or AXIS blocks)
  * @note  HAL driver does not ensure these clocks are used by peripherals, it's up to user code  */
#define __IS_PLL1_IN_USE() \
  ((((__HAL_RCC_GET_MPU_SOURCE() == RCC_MPUSOURCE_PLL1)   &&  (__HAL_RCC_GET_FLAG(RCC_FLAG_MPUSRCRDY) == 1U)) || \
    ((__HAL_RCC_GET_MPU_SOURCE() == RCC_MPUSOURCE_MPUDIV) &&  (__HAL_RCC_GET_FLAG(RCC_FLAG_MPUSRCRDY) == 1U)) ) ? \
   1U : 0U)

#define __IS_PLL2_IN_USE() \
  (  ( (__HAL_RCC_GET_AXIS_SOURCE() == RCC_AXISSOURCE_PLL2) &&  (__HAL_RCC_GET_FLAG(RCC_FLAG_AXISSRCRDY) == 1U) ) ? \
     1U : 0U)

#define __IS_PLL3_IN_USE() \
  (((__HAL_RCC_GET_MLAHB_SOURCE()  == RCC_MLAHBSSOURCE_PLL3)  &&  (__HAL_RCC_GET_FLAG(RCC_FLAG_MLAHBSSRCRDY) == 1U)) ? \
   1U : 0U)

/** @brief  Macros to enable or disable the Internal High Speed oscillator (HSI).
  * @note   The HSI is stopped by hardware when entering STOP and STANDBY modes.
  *         It is used (enabled by hardware) as system clock source after startup
  *         from Reset, wakeup from STOP and STANDBY mode, or in case of failure
  *         of the HSE used directly or indirectly as system clock (if the Clock
  *         Security System CSS is enabled).
  * @note   HSI can not be stopped if it is used as system clock source. In this case,
  *         you have to select another source of the system clock then stop the HSI.
  * @note   After enabling the HSI, the application software should wait on HSIRDY
  *         flag to be set indicating that HSI clock is stable and can be used as
  *         system clock source.
  *         This parameter can be: ENABLE or DISABLE.
  * @note   When the HSI is stopped, HSIRDY flag goes low after 6 HSI oscillator
  *         clock cycles.
  */
#define __HAL_RCC_HSI_ENABLE()   SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSION)
#define __HAL_RCC_HSI_DISABLE()  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSION)

/** @brief  Macro to adjust the Internal High Speed oscillator (HSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __HSICalibrationValue__: specifies the calibration trimming value
  *         HSITRIM. HSITRIM represents a signed value. HSITRIM field is added
  *         to the engineering Option Bytes loaded during reset phase
  *         (bsec_hsi_cal[11:0]) in order to form the calibration trimming value.
  *         HSICAL[11:0] = bsec_hsi_cal[11:0] + HSITRIM[6:0]
  *         This parameter must be a number between 0 and 0x7F:
  *         0x40: bsec_hsi_cal[11:0] - 64
  *         0x41: bsec_hsi_cal[11:0] - 63
  *         ...
  *         0x0: bsec_hsi_cal[11:0] (default after reset)
  *         ...
  *         0x3E: bsec_hsi_cal[11:0] + 62
  *         0x3F: bsec_hsi_cal[11:0] + 63
  */
#define __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(__HSICalibrationValue__) \
  MODIFY_REG(RCC->HSICFGR, RCC_HSICFGR_HSITRIM, \
             (uint32_t)(__HSICalibrationValue__) << RCC_HSICFGR_HSITRIM_Pos)


/**
  * @brief  Macro to configure HSI clock divider
  * @note   Set and reset by software to control the HSI clock division factor.
  * @note   It is not allowed to change HSIDIV, if the HSI is currently used as
  *         reference clock for a PLL.
  * @note   If TZEN = 1, this parameter can only be modified in secure mode.
  * @note   Write access to this register is not allowed during the clock restore sequence
  * @note   The application can check if the new division factor is taken into
  *         account by reading back the HSIDIVRDY flag
  *
  * @param  __RCC_HSIDIV__: specifies the HSI division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_HSI_DIV1:  Division by 1, ck_hsi(_ker) = 64 MHz (default after reset)
  *              @arg RCC_HSI_DIV2:  Division by 2, ck_hsi(_ker) = 32 MHz
  *              @arg RCC_HSI_DIV4:  Division by 4, ck_hsi(_ker) = 16 MHz
  *              @arg RCC_HSI_DIV8:  Division by 8, ck_hsi(_ker) =  8 MHz
  */
#define __HAL_RCC_HSI_DIV(__RCC_HSIDIV__) \
  do{  MODIFY_REG( RCC->HSICFGR, RCC_HSICFGR_HSIDIV , __RCC_HSIDIV__ );\
  } while(0)

/** @brief  Macro to get the HSI clock division factor.
  * @retval The HSI clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_HSI_DIV1:  Division by 1, ck_hsi(_ker) = 64 MHz (default after reset)
  *              - RCC_HSI_DIV2:  Division by 2, ck_hsi(_ker) = 32 MHz
  *              - RCC_HSI_DIV4:  Division by 4, ck_hsi(_ker) = 16 MHz
  *              - RCC_HSI_DIV8:  Division by 8, ck_hsi(_ker) =  8 MHz
  */
#define __HAL_RCC_GET_HSI_DIV() ((uint32_t)(RCC->HSICFGR & RCC_HSICFGR_HSIDIV ))


/**
  * @brief    Macros to enable or disable the force of the Internal High Speed oscillator (HSI)
  *           in STOP mode to be quickly available as kernel clock.
  * @note     Keeping the HSI ON in STOP mode allows to avoid slowing down the communication
  *           speed because of the HSI startup time.
  * @note     The enable of this function has not effect on the HSION bit.
  *           This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
#define __HAL_RCC_HSISTOP_ENABLE()           SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSIKERON)
#define __HAL_RCC_HSISTOP_DISABLE()          WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSIKERON)


/**
  * @brief  Macros to enable or disable the Internal  oscillator (CSI).
  * @note     The CSI is stopped by hardware when entering STOP and STANDBY modes.
  *           It is used (enabled by hardware) as system clock source after
  *           startup from Reset, wakeup from STOP and STANDBY mode, or in case
  *           of failure of the HSE used directly or indirectly as system clock
  *           (if the Clock Security System CSS is enabled).
  * @note     CSI can not be stopped if it is used as system clock source.
  *           In this case, you have to select another source of the system
  *           clock then stop the CSI.
  * @note     After enabling the CSI, the application software should wait on
  *           CSIRDY flag to be set indicating that CSI clock is stable and can
  *           be used as system clock source.
  * @note   When the CSI is stopped, CSIRDY flag goes low after 6 CSI oscillator
  *         clock cycles.
  */
#define __HAL_RCC_CSI_ENABLE()  SET_BIT(RCC->OCENSETR, RCC_OCENSETR_CSION)
#define __HAL_RCC_CSI_DISABLE() WRITE_REG(RCC->OCENCLRR, RCC_OCENSETR_CSION)

/** @brief  Macro Adjusts the Internal  oscillator (CSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal CSI RC.
  *         Please refer to the datasheet of the product for for more details on how to
  *         calibrate the CSI.
  * @param  __CSICalibrationValue__: specifies the calibration trimming value.
  *         This parameter must be a number between 0 and 0x1F.
  */
#define __HAL_RCC_CSI_CALIBRATIONVALUE_ADJUST(__CSICalibrationValue__) \
  MODIFY_REG(RCC->CSICFGR, RCC_CSICFGR_CSITRIM, \
             (uint32_t)(__CSICalibrationValue__) << RCC_CSICFGR_CSITRIM_Pos)

/**
  * @brief    Macros to enable or disable the force of the Internal High Speed oscillator (CSI)
  *           in STOP mode to be quickly available as kernel clock.
  * @note     Keeping the CSI ON in STOP mode allows to avoid slowing down the communication
  *           speed because of the CSI startup time.
  * @note     The enable of this function has not effect on the CSION bit.
  *           This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
#define __HAL_RCC_CSISTOP_ENABLE()            SET_BIT(RCC->OCENSETR, RCC_OCENSETR_CSIKERON)
#define __HAL_RCC_CSISTOP_DISABLE()           WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_CSIKERON)


/** @brief  Macros to enable or disable the Internal Low Speed oscillator (LSI).
  * @note   After enabling the LSI, the application software should wait on
  *         LSIRDY flag to be set indicating that LSI clock is stable and can
  *         be used to clock the IWDG and/or the RTC.
  * @note   LSI can not be disabled if the IWDG is running.
  * @note   When the LSI is stopped, LSIRDY flag goes low after 6 LSI oscillator
  *         clock cycles.
  */
#define __HAL_RCC_LSI_ENABLE()  SET_BIT(RCC->RDLSICR, RCC_RDLSICR_LSION)
#define __HAL_RCC_LSI_DISABLE() CLEAR_BIT(RCC->RDLSICR, RCC_RDLSICR_LSION)


/** @brief  Macro to configure the Minimum Reset Duration
  * @note   Set and reset by software. They define the minimum guaranteed
  *         duration of the NRST low pulse. The LSI oscillator is automatically
  *         enabled when needed by the RPCTL.
  * @note   00000: NRST low pulse duration is guaranteed by the pulse stretcher
  *                of the PAD. The RPCTL is bypassed (default after reset)
  *         00010: The guaranteed NRST low pulse duration is about 2 ms (2 x 32 ck_lsi cycles),
  *         ...
  *         11111: The guaranteed NRST low pulse duration is about 31 ms (31 x 32 ck_lsi cycles).
  */
#define __HAL_RCC_MRD_CONFIG(__DURATION__) \
  do { MODIFY_REG(RCC->RDLSICR, RCC_RDLSICR_MRD, \
                    (uint32_t)(__DURATION__) << RCC_RDLSICR_MRD_Pos); \
    HAL_Delay(1); \
  }  while(0)


/**
  * @brief  Macro (deprecated) to configure the External High Speed oscillator (HSE).
  * @note   Macro name is kept to maintain compatibility and it is mapped on
  *         HAL_RCC_HSEConfig function which replaces macro and should be used
  *         instead.
  * @note   HSE state can not be changed if it is used directly or through the
  *         PLL as system clock. In this case, you have to select another source
  *         of the system clock then change the HSE state (ex. disable it).
  * @note   The HSE is stopped by hardware when entering STOP and STANDBY modes.
  * @note   This function reset the CSSON bit, so if the clock security system(CSS)
  *         was previously enabled you have to enable it again after calling this
  *         function.
  * @param  __STATE__: specifies the new state of the HSE.
  *         This parameter can be one of the following values:
  *            @arg RCC_HSE_OFF: turn OFF the HSE oscillator
  *            @arg RCC_HSE_ON: turn ON the HSE oscillator using an external
  *                 crystal/ceramic resonator
  *            @arg RCC_HSE_BYPASS: HSE oscillator bypassed with external clock
  *                 using a low-swing analog signal provided to OSC_IN
  *            @arg RCC_HSE_BYPASS_DIG: HSE oscillator bypassed with external
  *                 clock using a full-swing digital signal provided to OSC_IN
  */
#define __HAL_RCC_HSE_CONFIG(__STATE__) HAL_RCC_HSEConfig(__STATE__)


/**
  * @brief    Macros to enable or disable the force of the External High Speed oscillator (HSE)
  *           in STOP mode to be quickly available as kernel clock.
  * @note     Keeping the HSE ON in STOP mode allows to avoid slowing down the communication
  *           speed because of the HSE startup time.
  * @note     The enable of this function has not effect on the HSION bit.
  *           This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
#define __HAL_RCC_HSESTOP_ENABLE()           SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSEKERON)
#define __HAL_RCC_HSESTOP_DISABLE()          WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSEKERON)


/**
  * @brief  Macro (deprecated) to configure the External Low Speed oscillator (LSE).
  * @note   Macro name is kept to maintain compatibility and it is mapped on
  *         HAL_RCC_LSEConfig function which replaces macro and should be used
  *         instead.
  * @note   As the LSE is in the Backup domain and write access is denied to
  *         this domain after reset, you have to enable write access using
  *         HAL_PWR_EnableBkUpAccess() function before to configure the LSE
  *         (to be done once after reset).
  * @param  __STATE__: specifies the new state of the LSE.
  *         This parameter can be a value of @ref RCC_LSE_Config
  *            @arg RCC_LSE_OFF: turn OFF the LSE oscillator
  *            @arg RCC_LSE_ON: turn ON the LSE oscillator using an external
  *                 crystal/ceramic resonator
  *            @arg RCC_LSE_BYPASS: LSE oscillator bypassed with external clock
  *                 using a low-swing analog signal provided to OSC32_IN
  *            @arg RCC_LSE_BYPASS_DIG: LSE oscillator bypassed with external clock using
  *                 a full-swing digital signal provided to OSC32_IN
  */
#define __HAL_RCC_LSE_CONFIG(__STATE__) HAL_RCC_LSEConfig(__STATE__)


/**
  * @brief  Macro to configures the External Low Speed oscillator (LSE) drive capability.
  * @note   As the LSE is in the Backup domain and write access is denied to
  *         this domain after reset, you have to enable write access using
  *         HAL_PWR_EnableBkUpAccess() function before to configure the LSE
  *         (to be done once after reset).
  * @param  __LSEDRIVE__: specifies the new state of the LSE drive capability.
  *          This parameter can be one of the following values:
  *            @arg RCC_LSEDRIVE_LOW: LSE oscillator low drive capability (default after backup domain reset)
  *            @arg RCC_LSEDRIVE_MEDIUMLOW: LSE oscillator medium low drive capability.
  *            @arg RCC_LSEDRIVE_MEDIUMHIGH: LSE oscillator medium high drive capability.
  *            @arg RCC_LSEDRIVE_HIGH: LSE oscillator high drive capability.
  * @retval None
  */
#define __HAL_RCC_LSEDRIVE_CONFIG(__LSEDRIVE__) \
  MODIFY_REG(RCC->BDCR, RCC_BDCR_LSEDRV, (uint32_t)(__LSEDRIVE__))


