zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @brief  Macro to get the clock source used as MCO1 clock.
  * @retval The clock source used as MCO1 clock. The returned value can be one
  *         of the following:
  *              - RCC_MCO1SOURCE_HSI:  HSI used as MCO1 clock (default after reset).
  *              - RCC_MCO1SOURCE_HSE:  HSE used as MCO1 clock.
  *              - RCC_MCO1SOURCE_CSI:  CSI used as MCO1 clock.
  *              - RCC_MCO1SOURCE_LSI:  LSI used as MCO1 clock.
  *              - RCC_MCO1SOURCE_LSE:  LSE used as MCO1 clock.
  */
#define __HAL_RCC_GET_MCO1_SOURCE() ((uint32_t)(RCC->MCO1CFGR & RCC_MCO1CFGR_MCO1SEL))

/** @brief  Macro to get the MCO1 prescaler value
  * @retval The MCO1 prescaler value. The returned value can be one
  *         of the following:
  *            - RCC_MCODIV_1:  bypass (default after reset)
  *            - RCC_MCODIV_2:  division by 2
  *            - RCC_MCODIV_3:  division by 3
  *            - RCC_MCODIV_4:  division by 4
  *            - RCC_MCODIV_5:  division by 5
  *            - RCC_MCODIV_6:  division by 6
  *            - RCC_MCODIV_7:  division by 7
  *            - RCC_MCODIV_8:  division by 8
  *            - RCC_MCODIV_9:  division by 9
  *            - RCC_MCODIV_10: division by 10
  *            - RCC_MCODIV_11: division by 11
  *            - RCC_MCODIV_12: division by 12
  *            - RCC_MCODIV_13: division by 13
  *            - RCC_MCODIV_14: division by 14
  *            - RCC_MCODIV_15: division by 15
  *            - RCC_MCODIV_16: division by 16
  */
#define __HAL_RCC_GET_MCO1_DIV() ((uint32_t)(RCC->MCO1CFGR & RCC_MCO1CFGR_MCO1DIV))


/** @brief  Macros to enable or disable the MCO2 output.
  *
  */
#define __HAL_RCC_MCO2_ENABLE()   SET_BIT(RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2ON)
#define __HAL_RCC_MCO2_DISABLE()  CLEAR_BIT(RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2ON)

/**
  * @brief  Macro to configure MCO2 prescaler
  * @note   Set and cleared by software to configure the prescaler of the MCO2.
  * @note   Modification of this prescaler may generate glitches on MCO2.
  * @note   It is highly recommended to change this prescaler only after reset,
  *         before enabling the external oscillators and the PLLs.
  *
  * @param  __RCC_MCO2SOURCE__: specifies the MCO2 entry clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCO2SOURCE_MPU: MPU clock selected as MCO2 clock entry (default after reset)
  *            @arg RCC_MCO2SOURCE_AXI: AXI clock selected as MCO2 clock entry
  *            @arg RCC_MCO2SOURCE_MLAHB: MLAHB clock selected as MCO2 clock entry
  *            @arg RCC_MCO2SOURCE_PLL4: PLL4 clock selected as MCO2 clock entry
  *            @arg RCC_MCO2SOURCE_HSE: HSE clock selected as MCO2 clock entry
  *            @arg RCC_MCO2SOURCE_HSI: HSI clock selected as MCO2 clock entry
  *
  * @param  __RCC_MCO2PRESCALER__: specifies the MCO2 prescaler value.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCODIV_1:  bypass (default after reset)
  *            @arg RCC_MCODIV_2:  division by 2
  *            @arg RCC_MCODIV_3:  division by 3
  *            @arg RCC_MCODIV_4:  division by 4
  *            @arg RCC_MCODIV_5:  division by 5
  *            @arg RCC_MCODIV_6:  division by 6
  *            @arg RCC_MCODIV_7:  division by 7
  *            @arg RCC_MCODIV_8:  division by 8
  *            @arg RCC_MCODIV_9:  division by 9
  *            @arg RCC_MCODIV_10: division by 10
  *            @arg RCC_MCODIV_11: division by 11
  *            @arg RCC_MCODIV_12: division by 12
  *            @arg RCC_MCODIV_13: division by 13
  *            @arg RCC_MCODIV_14: division by 14
  *            @arg RCC_MCODIV_15: division by 15
  *            @arg RCC_MCODIV_16: division by 16
  * @retval None
  */
#define __HAL_RCC_MCO2_CONFIGURE(__RCC_MCO2SOURCE__ , __RCC_MCO2PRESCALER__ ) \
  do{  MODIFY_REG( RCC->MCO2CFGR, (RCC_MCO2CFGR_MCO2SEL | RCC_MCO2CFGR_MCO2DIV) , \
                     ((__RCC_MCO2SOURCE__) | (__RCC_MCO2PRESCALER__)) );\
  } while(0)


/** @brief  Macro to get the clock source used as MCO2 clock.
  * @retval The clock source used as MCO2 clock. The returned value can be one
  *         of the following:
  *              - RCC_MCO2SOURCE_MPU:  MPU used as MCO2 clock (default after reset).
  *              - RCC_MCO2SOURCE_AXI:  AXI used as MCO2 clock.
  *              - RCC_MCO2SOURCE_MLAHB:  MLAHB used as MCO2 clock.
  *              - RCC_MCO2SOURCE_PLL4: PLL4 used as MCO2 clock.
  *              - RCC_MCO2SOURCE_HSE:  HSE used as MCO2 clock.
  *              - RCC_MCO2SOURCE_HSI:  HSI used as MCO2 clock.
  */
#define __HAL_RCC_GET_MCO2_SOURCE() ((uint32_t)(RCC->MCO2CFGR & RCC_MCO2CFGR_MCO2SEL))

/** @brief  Macro to get the MCO2 prescaler value
  * @retval The MCO2 prescaler value. The returned value can be one
  *         of the following:
  *            - RCC_MCODIV_1:  bypass (default after reset)
  *            - RCC_MCODIV_2:  division by 2
  *            - RCC_MCODIV_3:  division by 3
  *            - RCC_MCODIV_4:  division by 4
  *            - RCC_MCODIV_5:  division by 5
  *            - RCC_MCODIV_6:  division by 6
  *            - RCC_MCODIV_7:  division by 7
  *            - RCC_MCODIV_8:  division by 8
  *            - RCC_MCODIV_9:  division by 9
  *            - RCC_MCODIV_10: division by 10
  *            - RCC_MCODIV_11: division by 11
  *            - RCC_MCODIV_12: division by 12
  *            - RCC_MCODIV_13: division by 13
  *            - RCC_MCODIV_14: division by 14
  *            - RCC_MCODIV_15: division by 15
  *            - RCC_MCODIV_16: division by 16
  */
#define __HAL_RCC_GET_MCO2_DIV() ((uint32_t)(RCC->MCO2CFGR & RCC_MCO2CFGR_MCO2DIV))


/**
  * @brief  Macro to configure MPU sub-system clock source
  * @note   Set and reset by software to select the MPU sub-system clock source (ck_mpuss)
  * @note   If TZEN = 1, it is only possible to modify this parameter in secure mode
  * @note   Write access is not allowed during the clock restore sequence
  *
  * @param  __RCC_MPUSOURCE__: specifies the MPU entry clock source.
  *          This parameter can be one of the following values:
  *              @arg RCC_MPUSOURCE_HSI:   HSI used as MPU clock (default after reset).
  *              @arg RCC_MPUSOURCE_HSE:   HSE used as MPU clock.
  *              @arg RCC_MPUSOURCE_PLL1:  PLL1 used as MPU clock.
  *              @arg RCC_MPUSOURCE_MPUDIV: MPUDIV used as MPU clock.
  */
#define __HAL_RCC_MPU_SOURCE(__RCC_MPUSOURCE__) \
  do{  MODIFY_REG( RCC->MPCKSELR, RCC_MPCKSELR_MPUSRC , __RCC_MPUSOURCE__ );\
  } while(0)

/** @brief  Macro to get the clock source used as MPU clock.
  * @retval The clock source used as MPU clock. The returned value can be one
  *         of the following:
  *              - RCC_MPUSOURCE_HSI:   HSI used as MPU clock (default after reset).
  *              - RCC_MPUSOURCE_HSE:   HSE used as MPU clock.
  *              - RCC_MPUSOURCE_PLL1:  PLL1 used as MPU clock.
  *              - RCC_MPUSOURCE_MPUDIV: MPU used as MPU clock.
  */
#define __HAL_RCC_GET_MPU_SOURCE() ((uint32_t)(RCC->MPCKSELR & RCC_MPCKSELR_MPUSRC))


/**
  * @brief  Macro to configure AXISS clock source
  * @note   Set and reset by software to select the AXI sub-system clock source (ck_axiss)
  * @note   If TZEN = 1, it is only possible to modify this parameter in secure mode
  * @note   Write access is not allowed during the clock restore sequence
  *
  * @param  __RCC_AXISSOURCE__: specifies the AXISS entry clock source.
  *          This parameter can be one of the following values:
  *              @arg RCC_AXISSOURCE_HSI:   HSI used as AXISS clock (default after reset).
  *              @arg RCC_AXISSOURCE_HSE:   HSE used as AXISS clock.
  *              @arg RCC_AXISSOURCE_PLL2:  PLL2 used as AXISS clock.
  *              @arg RCC_AXISSOURCE_OFF:   AXISS clock is gated.
  */
#define __HAL_RCC_AXISS_SOURCE(__RCC_AXISSOURCE__) \
  do{  MODIFY_REG( RCC->ASSCKSELR, RCC_ASSCKSELR_AXISSRC , __RCC_AXISSOURCE__ );\
  } while(0)

