zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @brief  Macro to get the clock source used as AXIS clock.
  * @retval The clock source used as AXIS clock. The returned value can be one
  *         of the following:
  *              - RCC_AXISSOURCE_HSI:  HSI used as AXIS clock (default after reset).
  *              - RCC_AXISSOURCE_HSE:  HSE used as AXIS clock.
  *              - RCC_AXISSOURCE_PLL2: PLL2 used as AXIS clock.
  *              - RCC_AXISSOURCE_OFF:  AXIS clock is gated.
  */
#define __HAL_RCC_GET_AXIS_SOURCE() ((uint32_t)(RCC->ASSCKSELR & RCC_ASSCKSELR_AXISSRC))


/**
  * @brief  Macro to configure MLAHB sub-system clock source
  * @note   Set and reset by software to select the MLAHB sub-system clock source (ck_MLAHBss)
  * @note   If TZEN = 1, it is only possible to modify this parameter in secure mode
  * @note   Write access is not allowed during the clock restore sequence
  *
  * @param  __RCC_MLAHBSSOURCE__: specifies the MLAHB entry clock source.
  *          This parameter can be one of the following values:
  *              @arg RCC_MLAHBSSOURCE_HSI:   HSI used as MLAHB clock (default after reset).
  *              @arg RCC_MLAHBSSOURCE_HSE:   HSE used as MLAHB clock.
  *              @arg RCC_MLAHBSSOURCE_PLL3:  PLL3 used as MLAHB clock.
  */
#define __HAL_RCC_MLAHB_SOURCE(__RCC_MLAHBSSOURCE__) \
  do{  MODIFY_REG( RCC->MSSCKSELR, RCC_MSSCKSELR_MLAHBSSRC , __RCC_MLAHBSSOURCE__ );\
  } while(0)

/** @brief  Macro to get the clock source used as MLAHB clock.
  * @retval The clock source used as MLAHB clock. The returned value can be one
  *         of the following:
  *             - RCC_MLAHBSSOURCE_HSI:  HSI used as MLAHB clock (default after reset).
  *             - RCC_MLAHBSSOURCE_HSE:  HSE used as MLAHB clock.
  *             - RCC_MLAHBSSOURCE_CSI:  CSI used as MLAHB clock.
  *             - RCC_MLAHBSSOURCE_PLL3: PLL3 used as MLAHB clock.
  */
#define __HAL_RCC_GET_MLAHB_SOURCE() ((uint32_t)(RCC->MSSCKSELR & RCC_MSSCKSELR_MLAHBSSRC))

/**
  * @brief  Macro to set the HSE division factor for RTC clock
  * @note   Set and cleared by software to divide the HSE to generate a clock for RTC.
  * @note   If TZEN = 1, this parameter can only be modified in secure mode
  * @note   Caution: The software has to set these bits correctly to ensure that the clock
  *         supplied to the RTC is lower than 4 MHz.
  * @note   These bits must be configured if needed before selecting the RTC clock source
  *
  * @param  __HSEDIV__: Specifies the HSE division factor for RTC clock
  *               This parameter must be a number between 1 and 64. Eg.:
  *               1:  HSE (default after reset)
  *               2:  HSE/2
  *               64: HSE/64
  * @retval None
  */
#define __HAL_RCC_RTC_HSEDIV(__HSEDIV__) \
  do{  MODIFY_REG( RCC->RTCDIVR, RCC_RTCDIVR_RTCDIV ,  (__HSEDIV__ -1U ));  \
  } while(0)

/** @brief  Macro to get the HSE division factor for RTC clock.
  * @retval The HSE division factor for RTC clock. The returned value can be a number between 1 and 64 Eg.:
  *               1:  HSE (default after reset)
  *               2:  HSE/2
  *               64: HSE/64
  */
#define __HAL_RCC_GET_RTC_HSEDIV() ((uint32_t)((RCC->RTCDIVR & RCC_RTCDIVR_RTCDIV) + 1U ))

/**
  * @brief  Macro to configure MPU Core clock divider
  * @note   Set and reset by software to control the MPU clock division factor.
  * @note   If TZEN = 1, this parameter can only be modified in secure mode.
  * @note   It is possible to change this division ratio on-the-fly. It impacts only the frequency of MPU clock.
  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_mpuss cycles after MPUDIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the MPUDIVRDY flag
  *
  * @param  __RCC_MPUDIV__: specifies the MPU division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_MPU_DIV_OFF:  The MPUDIV is disabled (default after reset)
  *              @arg RCC_MPU_DIV2:  ck_mpuss divided by 2
  *              @arg RCC_MPU_DIV4:  ck_mpuss divided by 4
  *              @arg RCC_MPU_DIV8:  ck_mpuss divided by 8
  *              @arg RCC_MPU_DIV16: ck_mpuss divided by 16
  *
  * @note   Warning: Do not set RCC_MPU_DIV_OFF if the MPUSRC = RCC_MPUSOURCE_MPUDIV,
  *         otherwise the processor will no longer be clocked
  */
#define __HAL_RCC_MPU_DIV(__RCC_MPUDIV__) \
  do{  MODIFY_REG( RCC->MPCKDIVR, RCC_MPCKDIVR_MPUDIV , __RCC_MPUDIV__ );\
  } while(0)

/** @brief  Macro to get the MPU clock division factor.
  * @retval The MPU clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_MPU_DIV_OFF:  The MPUDIV is disabled (default after reset)
  *              - RCC_MPU_DIV2:  ck_mpuss divided by 2
  *              - RCC_MPU_DIV4:  ck_mpuss divided by 4
  *              - RCC_MPU_DIV8:  ck_mpuss divided by 8
  *              - RCC_MPU_DIV16: ck_mpuss divided by 16
  */
#define __HAL_RCC_GET_MPU_DIV() ((uint32_t)(RCC->MPCKDIVR & RCC_MPCKDIVR_MPUDIV ))


/**
  * @brief  Macro to configure AXI Core clock divider
  * @note   Set and reset by software to control the  AXI, AHB5 and AHB6 clock division factor.
  * @note   If TZEN = 1, this parameter can only be modified in secure mode.
  * @note   It is possible to change this division ratio on-the-fly. It impacts the frequency
  *         of AXI, APB4, APB5 AHB5 and AHB6 clocks.
  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_axiss cycles after AXIDIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the AXIDIVRDY flag
  *
  * @param  __RCC_AXIDIV__: specifies the AXI division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_AXI_DIV1:  ck_axiss not divided (default after reset)
  *              @arg RCC_AXI_DIV2:  ck_axiss divided by 2
  *              @arg RCC_AXI_DIV3:  ck_axiss divided by 3
  *              @arg RCC_AXI_DIV4:  ck_axiss divided by 4
  */
#define __HAL_RCC_AXI_DIV(__RCC_AXIDIV__) \
  do{  MODIFY_REG( RCC->AXIDIVR, RCC_AXIDIVR_AXIDIV , __RCC_AXIDIV__ );\
  } while(0)

/** @brief  Macro to get the AXI, AHB5 and AHB6 clock division factor.
  * @retval The AXI clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_AXI_DIV1:  ck_axiss not divided (default after reset)
  *              - RCC_AXI_DIV2:  ck_axiss divided by 2
  *              - RCC_AXI_DIV3:  ck_axiss divided by 3
  *              - RCC_AXI_DIV4:  ck_axiss divided by 4
  */
#define __HAL_RCC_GET_AXI_DIV() ((uint32_t)(RCC->AXIDIVR & RCC_AXIDIVR_AXIDIV ))


/**
  * @brief  Macro to configure APB4 clock divider
  * @note   Set and reset by software to control the  APB4 clock division factor.
  * @note   If TZEN = 1, this parameter can only be modified in secure mode.
  * @note   It is possible to change this division ratio on-the-fly. It impacts only the APB4 clock.
  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_aclk cycles after APB4DIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the APB4DIVRDY flag
  *
  * @param  __RCC_APB4DIV__: specifies the APB4 division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_APB4_DIV1:  ck_aclk not divided (default after reset)
  *              @arg RCC_APB4_DIV2:  ck_aclk divided by 2
  *              @arg RCC_APB4_DIV4:  ck_aclk divided by 4
  *              @arg RCC_APB4_DIV8:  ck_aclk divided by 8
  *              @arg RCC_APB4_DIV16: ck_aclk divided by 16
  */
#define __HAL_RCC_APB4_DIV(__RCC_APB4DIV__) \
  do{  MODIFY_REG( RCC->APB4DIVR, RCC_APB4DIVR_APB4DIV , __RCC_APB4DIV__ );\
  } while(0)

