zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @brief  Macro to get the APB4 clock division factor.
  * @retval The APB4 clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_APB4_DIV1:  ck_aclk not divided (default after reset)
  *              - RCC_APB4_DIV2:  ck_aclk divided by 2
  *              - RCC_APB4_DIV4:  ck_aclk divided by 4
  *              - RCC_APB4_DIV8:  ck_aclk divided by 8
  *              - RCC_APB4_DIV16: ck_aclk divided by 16
  */
#define __HAL_RCC_GET_APB4_DIV() ((uint32_t)(RCC->APB4DIVR & RCC_APB4DIVR_APB4DIV ))


/**
  * @brief  Macro to configure APB5 clock divider
  * @note   Set and reset by software to control the  APB5 clock division factor.
  * @note   If TZEN = 1, this parameter can only be modified in secure mode.
  * @note   It is possible to change this division ratio on-the-fly. It impacts only the APB5 clock.
  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_aclk cycles after APB5DIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the APB5DIVRDY flag
  *
  * @param  __RCC_APB5DIV__: specifies the APB5 division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_APB5_DIV1:  ck_aclk not divided (default after reset)
  *              @arg RCC_APB5_DIV2:  ck_aclk divided by 2
  *              @arg RCC_APB5_DIV4:  ck_aclk divided by 4
  *              @arg RCC_APB5_DIV8:  ck_aclk divided by 8
  *              @arg RCC_APB5_DIV16: ck_aclk divided by 16
  */
#define __HAL_RCC_APB5_DIV(__RCC_APB5DIV__) \
  do{  MODIFY_REG( RCC->APB5DIVR, RCC_APB5DIVR_APB5DIV , __RCC_APB5DIV__ );\
  } while(0)

/** @brief  Macro to get the APB5 clock division factor.
  * @retval The APB5 clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_APB5_DIV1:  ck_aclk not divided (default after reset)
  *              - RCC_APB5_DIV2:  ck_aclk divided by 2
  *              - RCC_APB5_DIV4:  ck_aclk divided by 4
  *              - RCC_APB5_DIV8:  ck_aclk divided by 8
  *              - RCC_APB5_DIV16: ck_aclk divided by 16
  */
#define __HAL_RCC_GET_APB5_DIV() ((uint32_t)(RCC->APB5DIVR & RCC_APB5DIVR_APB5DIV ))


/**
  * @brief  Macro to configure MLAHB clock divider
  * @note   Set and reset by software to control the  MLAHB clock division factor.
  * @note   If TZEN = 1, this parameter can only be modified in secure mode.
  * @note   Changing this division ratio has an impact on the frequency of MLAHB clock, and all bus matrix clocks.
  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_mlahbss
  *         cycles after MLAHBDIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the MLAHBDIVRDY flag
  *
  * @param  __RCC_MLAHBDIV__: specifies the MLAHB division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_MLAHB_DIV1:  ck_mlahbss not divided (default after reset)
  *              @arg RCC_MLAHB_DIV2:  ck_mlahbss divided by 2
  *              @arg RCC_MLAHB_DIV4:  ck_mlahbss divided by 4
  *              @arg RCC_MLAHB_DIV8:  ck_mlahbss divided by 8
  *              @arg RCC_MLAHB_DIV16: ck_mlahbss divided by 16
  *              @arg RCC_MLAHB_DIV32: ck_mlahbss divided by 32
  *              @arg RCC_MLAHB_DIV64: ck_mlahbss divided by 64
  *              @arg RCC_MLAHB_DIV128: ck_mlahbss divided by 128
  *              @arg RCC_MLAHB_DIV256: ck_mlahbss divided by 256
  *              @arg RCC_MLAHB_DIV512: ck_mlahbss divided by 512
  */
#define __HAL_RCC_MLAHB_DIV(__RCC_MLAHBDIV__) \
  do{  MODIFY_REG( RCC->MLAHBDIVR, RCC_MLAHBDIVR_MLAHBDIV , __RCC_MLAHBDIV__ );\
  } while(0)

/** @brief  Macro to get the MLAHB clock division factor.
  * @retval The MLAHB clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_MLAHB_DIV1:  ck_mlahbss not divided (default after reset)
  *              - RCC_MLAHB_DIV2:  ck_mlahbss divided by 2
  *              - RCC_MLAHB_DIV4:  ck_mlahbss divided by 4
  *              - RCC_MLAHB_DIV8:  ck_mlahbss divided by 8
  *              - RCC_MLAHB_DIV16: ck_mlahbss divided by 16
  *              - RCC_MLAHB_DIV32: ck_mlahbss divided by 32
  *              - RCC_MLAHB_DIV64: ck_mlahbss divided by 64
  *              - RCC_MLAHB_DIV128: ck_mlahbss divided by 128
  *              - RCC_MLAHB_DIV256: ck_mlahbss divided by 256
  *              - RCC_MLAHB_DIV512: ck_mlahbss divided by 512
  */
#define __HAL_RCC_GET_MLAHB_DIV() ((uint32_t)(RCC->MLAHBDIVR & RCC_MLAHBDIVR_MLAHBDIV ))

/**
  * @brief  Macro to configure APB1 clock divider
  * @note   Set and reset by software to control the  APB1 clock division factor.
  * @note   It is possible to change this division ratio on-the-fly. It impacts only the APB1 clock.
  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_hclk cycles after APB1DIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the APB1DIVRDY flag
  *
  * @param  __RCC_APB1DIV__: specifies the APB1 division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_APB1_DIV1:  ck_hclk not divided (default after reset)
  *              @arg RCC_APB1_DIV2:  ck_hclk divided by 2
  *              @arg RCC_APB1_DIV4:  ck_hclk divided by 4
  *              @arg RCC_APB1_DIV8:  ck_hclk divided by 8
  *              @arg RCC_APB1_DIV16: ck_hclk divided by 16
  */
#define __HAL_RCC_APB1_DIV(__RCC_APB1DIV__) \
  do{  MODIFY_REG( RCC->APB1DIVR, RCC_APB1DIVR_APB1DIV , __RCC_APB1DIV__ );\
  } while(0)

/** @brief  Macro to get the APB1 clock division factor.
  * @retval The APB1 clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_APB1_DIV1:  ck_hclk not divided (default after reset)
  *              - RCC_APB1_DIV2:  ck_hclk divided by 2
  *              - RCC_APB1_DIV4:  ck_hclk divided by 4
  *              - RCC_APB1_DIV8:  ck_hclk divided by 8
  *              - RCC_APB1_DIV16: ck_hclk divided by 16
  */
#define __HAL_RCC_GET_APB1_DIV() ((uint32_t)(RCC->APB1DIVR & RCC_APB1DIVR_APB1DIV ))


/**
  * @brief  Macro to configure APB2 clock divider
  * @note   Set and reset by software to control the  APB2 clock division factor.
  * @note   It is possible to change this division ratio on-the-fly. It impacts only the APB2 clock.

  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_hclk cycles after APB2DIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the APB2DIVRDY flag
  *
  * @param  __RCC_APB2DIV__: specifies the APB2 division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_APB2_DIV1:  ck_hclk not divided (default after reset)
  *              @arg RCC_APB2_DIV2:  ck_hclk divided by 2
  *              @arg RCC_APB2_DIV4:  ck_hclk divided by 4
  *              @arg RCC_APB2_DIV8:  ck_hclk divided by 8
  *              @arg RCC_APB2_DIV16: ck_hclk divided by 16
  */
#define __HAL_RCC_APB2_DIV(__RCC_APB2DIV__) \
  do{  MODIFY_REG( RCC->APB2DIVR, RCC_APB2DIVR_APB2DIV , __RCC_APB2DIV__ );\
  } while(0)

