zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
/** @brief  Macro to get the APB2 clock division factor.
  * @retval The APB2 clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_APB2_DIV1:  ck_hclk not divided (default after reset)
  *              - RCC_APB2_DIV2:  ck_hclk divided by 2
  *              - RCC_APB2_DIV4:  ck_hclk divided by 4
  *              - RCC_APB2_DIV8:  ck_hclk divided by 8
  *              - RCC_APB2_DIV16: ck_hclk divided by 16
  */
#define __HAL_RCC_GET_APB2_DIV() ((uint32_t)(RCC->APB2DIVR & RCC_APB2DIVR_APB2DIV ))


/**
  * @brief  Macro to configure APB3 clock divider
  * @note   Set and reset by software to control the  APB3 clock division factor.
  * @note   It is possible to change this division ratio on-the-fly. It impacts only the APB3 clock.

  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_hclk cycles after APB3DIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the APB3DIVRDY flag
  *
  * @param  __RCC_APB3DIV__: specifies the APB3 division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_APB3_DIV1:  ck_hclk not divided (default after reset)
  *              @arg RCC_APB3_DIV2:  ck_hclk divided by 2
  *              @arg RCC_APB3_DIV4:  ck_hclk divided by 4
  *              @arg RCC_APB3_DIV8:  ck_hclk divided by 8
  *              @arg RCC_APB3_DIV16: ck_hclk divided by 16
  */
#define __HAL_RCC_APB3_DIV(__RCC_APB3DIV__) \
  do{  MODIFY_REG( RCC->APB3DIVR, RCC_APB3DIVR_APB3DIV , __RCC_APB3DIV__ );\
  } while(0)

/** @brief  Macro to get the APB3 clock division factor.
  * @retval The APB3 clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_APB3_DIV1:  ck_hclk not divided (default after reset)
  *              - RCC_APB3_DIV2:  ck_hclk divided by 2
  *              - RCC_APB3_DIV4:  ck_hclk divided by 4
  *              - RCC_APB3_DIV8:  ck_hclk divided by 8
  *              - RCC_APB3_DIV16: ck_hclk divided by 16
  */
#define __HAL_RCC_GET_APB3_DIV() ((uint32_t)(RCC->APB3DIVR & RCC_APB3DIVR_APB3DIV ))

#if defined(RCC_APB6DIVR_APB6DIV)
/**
  * @brief  Macro to configure APB6 clock divider
  * @note   Set and reset by software to control the  APB6 clock division factor.
  * @note   If TZEN = 1, this parameter can only be modified in secure mode.
  * @note   It is possible to change this division ratio on-the-fly. It impacts only the APB6 clock.
  * @note   The clocks are divided with the new prescaler factor, from 1 to 16 ck_aclk cycles after APB6DIV update.
  * @note   The application can check if the new division factor is taken into account by
  *         reading back the APB6DIVRDY flag
  *
  * @param  __RCC_APB6DIV__: specifies the APB6 division factor
  *          This parameter can be one of the following values:
  *              @arg RCC_APB6_DIV1:  ck_aclk not divided (default after reset)
  *              @arg RCC_APB6_DIV2:  ck_aclk divided by 2
  *              @arg RCC_APB6_DIV4:  ck_aclk divided by 4
  *              @arg RCC_APB6_DIV8:  ck_aclk divided by 8
  *              @arg RCC_APB6_DIV16: ck_aclk divided by 16
  */
#define __HAL_RCC_APB6_DIV(__RCC_APB6DIV__) \
  do{  MODIFY_REG( RCC->APB6DIVR, RCC_APB6DIVR_APB6DIV , __RCC_APB6DIV__ );\
  } while(0)

/** @brief  Macro to get the APB6 clock division factor.
  * @retval The APB6 clock division factor. The returned value can be one
  *         of the following:
  *              - RCC_APB6_DIV1:  ck_aclk not divided (default after reset)
  *              - RCC_APB6_DIV2:  ck_aclk divided by 2
  *              - RCC_APB6_DIV4:  ck_aclk divided by 4
  *              - RCC_APB6_DIV8:  ck_aclk divided by 8
  *              - RCC_APB6_DIV16: ck_aclk divided by 16
  */
#define __HAL_RCC_GET_APB6_DIV() ((uint32_t)(RCC->APB6DIVR & RCC_APB6DIVR_APB6DIV ))
#endif /* RCC_APB6DIVR_APB6DIV */

/** @brief  Enable RCC interrupt (Perform Byte access to RCC_CIR bits to enable
  *         the selected interrupts).
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_CSIRDY:  CSI ready interrupt
  *            @arg RCC_IT_PLLRDY:  Main PLL ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  *            @arg RCC_IT_ALL:     All RCC interrupts
  */
#ifdef CORE_CA7
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) SET_BIT(RCC->MP_CIER, (__INTERRUPT__))
#endif /* CORE_CA7 */

/** @brief Disable RCC interrupt (Perform Byte access to RCC_CIR[14:8] bits to disable
  *        the selected interrupts).
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_CSIRDY:  CSI ready interrupt
  *            @arg RCC_IT_PLLRDY:  Main PLL ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  *            @arg RCC_IT_ALL:     All RCC interrupts
  */
#ifdef CORE_CA7
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->MP_CIER, (__INTERRUPT__))
#endif /* CORE_CA7 */


/** @brief  Clear the RCC's interrupt pending bits (Perform Byte access to RCC_CIR[23:16]
  *         bits to clear the selected interrupt pending bits.
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_CSIRDY:  CSI ready interrupt
  *            @arg RCC_IT_PLLRDY:  Main PLL ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  *            @arg RCC_IT_ALL:     All RCC interrupts
  */
#ifdef CORE_CA7
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) (RCC->MP_CIFR = (__INTERRUPT__))
#endif /* CORE_CA7 */

/** @brief  Check the RCC's interrupt has occurred or not.
  * @param  __INTERRUPT__: specifies the RCC interrupt source to check.
  *         This parameter can be one of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_CSIRDY:  CSI ready interrupt
  *            @arg RCC_IT_PLLRDY:  Main PLL ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  *            @arg RCC_IT_ALL:     All RCC interrupts
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#ifdef CORE_CA7
#define __HAL_RCC_GET_IT(__INTERRUPT__) ((RCC->MP_CIFR & (__INTERRUPT__)) == (__INTERRUPT__))
#endif /* CORE_CA7 */
/**
  * @}
  */
/* Include RCC HAL Extension module */
#include "stm32mp13xx_hal_rcc_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCC_Exported_Functions RCC Exported Functions
  * @{
  */

/** @addtogroup RCC_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */
/* Initialization and de-initialization functions  ******************************/
HAL_StatusTypeDef HAL_RCC_DeInit(void);
HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef *RCC_OscInitStruct);
HAL_StatusTypeDef HAL_RCC_HSEConfig(uint32_t State);
HAL_StatusTypeDef HAL_RCC_LSEConfig(uint32_t State);

HAL_StatusTypeDef RCC_PLL1_Config(const RCC_PLLInitTypeDef *pll1);
HAL_StatusTypeDef RCC_MPUConfig(const RCC_MPUInitTypeDef *RCC_MPUInitStruct);
HAL_StatusTypeDef HAL_RCC_ClockConfig(const RCC_ClkInitTypeDef *RCC_ClkInitStruct);
HAL_StatusTypeDef HAL_RCC_LSEDriveConfig(uint32_t LseDriveValue);
void     HAL_RCC_GetOscConfig(RCC_OscInitTypeDef *RCC_OscInitStruct);
void     HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef *RCC_ClkInitStruct, const uint32_t *pFLatency);

