zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc.h
void     HAL_RCC_WAKEUP_IRQHandler(void);
void     HAL_RCC_WAKEUP_Callback(void);
void     HAL_RCC_IRQHandler(void);
void     HAL_RCC_Callback(uint32_t Flags);
void     HAL_RCC_EnableHSECSS(void);


/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group2 Peripheral Control functions
  * @{
  */
/* Peripheral Control functions  ************************************************/
void     HAL_RCC_MCOConfig(uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv);
/* Get frequency functions  *****************************************************/
void     HAL_RCC_GetPLL1ClockFreq(PLL1_ClocksTypeDef *PLL1_Clocks);
void     HAL_RCC_GetPLL2ClockFreq(PLL2_ClocksTypeDef *PLL2_Clocks);
void     HAL_RCC_GetPLL3ClockFreq(PLL3_ClocksTypeDef *PLL3_Clocks);
void     HAL_RCC_GetPLL4ClockFreq(PLL4_ClocksTypeDef *PLL4_Clocks);

uint32_t HAL_RCC_GetMPUSSFreq(void);
uint32_t HAL_RCC_GetAXISSFreq(void);
uint32_t HAL_RCC_GetMLAHBSSFreq(void);
uint32_t HAL_RCC_GetACLKFreq(void);
uint32_t HAL_RCC_GetHCLK1Freq(void);
uint32_t HAL_RCC_GetHCLK2Freq(void);
uint32_t HAL_RCC_GetHCLK3Freq(void);
uint32_t HAL_RCC_GetHCLK4Freq(void);
uint32_t HAL_RCC_GetHCLK5Freq(void);
uint32_t HAL_RCC_GetHCLK6Freq(void);
uint32_t HAL_RCC_GetMLAHBFreq(void);
uint32_t HAL_RCC_GetFCLKFreq(void);
uint32_t HAL_RCC_GetMLHCLKFreq(void);
uint32_t HAL_RCC_GetPCLK1Freq(void);
uint32_t HAL_RCC_GetPCLK2Freq(void);
uint32_t HAL_RCC_GetPCLK3Freq(void);
uint32_t HAL_RCC_GetPCLK4Freq(void);
uint32_t HAL_RCC_GetPCLK5Freq(void);
#if defined(RCC_APB6DIVR_APB6DIV)
uint32_t HAL_RCC_GetPCLK6Freq(void);
#endif /* RCC_APB6DIVR_APB6DIV */

uint32_t HAL_RCC_GetSystemCoreClockFreq(void);

uint32_t RCC_GetCKPERFreq(void);
/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_Private_Constants RCC Private Constants
  * @{
  */

#define LSE_TIMEOUT_VALUE          LSE_STARTUP_TIMEOUT
#define HSE_TIMEOUT_VALUE          HSE_STARTUP_TIMEOUT
#define HSI_TIMEOUT_VALUE          (100U)  /* 100 ms */
#define CSI_TIMEOUT_VALUE          (100U)  /* 100 ms */
#define LSI_TIMEOUT_VALUE          (100U)  /* 100 ms */
#define PLL_TIMEOUT_VALUE          (100U)  /* 100 ms */
#define CLOCKSWITCH_TIMEOUT_VALUE  (1000U) /* 1 s    */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCC_Private_Macros RCC Private Macros
  * @{
  */

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* __STM32MP13xx_HAL_RCC_H */
